{"funny": ["It's metric military time, stupid American.", "I think this comment broke everything. ", "Wait, are you kidding? newlinechar  newlinechar I hope so...", "So did she £ him?", "I saw that as well :)", "no, but he #ed her", "He hashed her?", "It crashes Firefox 3.6 too :(", "Hey! Did you know that you can put a &gt; at the beginning of a line to quote people? Like this: newlinechar  newlinechar &gt; Unless you built a radio with frequencies to listen to the emotional detachment of polar bears", "What does the 'stat' part mean anyway? I know it means 'right now', but what's its etymology?", "Should've used Opera or Chrome.", "Etymology 1 newlinechar  newlinechar From Latin statim (“‘immediately’”). newlinechar  newlinechar -from wiki", "That's also known as a pound symbol. At least, it is in some to all of America. I don't know about the rest of the world.  newlinechar  newlinechar  newlinechar  newlinechar (Go on, make the ignorant American joke. You know you want to)", "Your sarcasm is as eloquent as it is loud.", "IT IS IMPOSSIBLE FOR ME TO THANK YOU WITHOUT BETRAYING THE SPIRIT OF MY NOVELTY ACCOUNT", "...or the story takes place some time in the past", "Do you seriously not know?", "Don't downvote this man. Some people don't know how to format, and we all gotta learn somehow.", "^ newlinechar  newlinechar | newlinechar  newlinechar | newlinechar  newlinechar That's the post of the day right there folks!~", "...or very right.", "Are you one of the writers from the show Lost?", "An unfortunate talent. ", "SMALLER THAN A FACT BUT JUST AS FILLING.", "And that's presuming the dude had sex the same year he was born.", "Sad, You beat Thraxil by 1 minute with the same message, but he's getting more upvotes. Well, have an upvote.", "At worst Chrome will say 'yo, bro, this process is going slow, you wanna kill it?' and be done with it.", "No, that's just a diet fact.", "Well... his penis *was* in a vagina.", "YOU'RE A DIET FACT.", "The world is a cruel place.", "You should have just said 'THANKS'", "YOU CLEARLY HAVE A FIRM GRASP OF THE PURPOSE OF THIS NOVELTY ACCOUNT", "Reddit is a cruel place", "So, actually, there are no virgins...  newlinechar  newlinechar and, if you're a 'virgin', the last girl you 'had' was your mother...", "Reddit is my world.", "So's your face.", "As an ignorant American joke enjoying American I approve this request.", "Whoa man, don't make me lower my speakers.", "Reddit needs a bus like that.", "Here's some bleach.  I don't care how, but please apply it to your brain.", "I disagree. Trolling is an art.", "I bet he even has information animal, vegetable and mineral.", "The world is just a mmrl reddit", "It'd be full of dudes, all saying 'FUCK! Why did we think this would attract women?!'", "it took me about a minute, and i was like, oo000o0o0o0o0o0o0o0o", "&gt; You read 2002 as 'two thousand two' if it's a year newlinechar  newlinechar Some people do. Both ways are correct.", "And mine, for having read that. ", "Well, I suppose that's true.  I just usually hear it the other way, so it would sound odd, and for the misdirection of the joke to work, it has to sound natural.", "You forgot 9.   newlinechar  newlinechar No one ever remembers 9.", "How very meta, in an ironic sort of way.", "Shut up you soshulist!", "That's what she said.", "^   newlinechar |   newlinechar  newlinechar Thanks for the arrow, I didn't know what you were talking about for a second.", "I'm going to delete myself.", "I once kidded a young lady attending [RPI](http://www.rpi.edu/) about how lucky she was, considering that the ratio of male to female students was very high.  newlinechar  newlinechar 'You know what they say,' she replied. 'The odds are good, but the goods are odd.'", "But I did. (I'm serious by nature.)", "Well it did get eaten.", "Yeah, everyone is going to kill him when they realized he's using tinypic.", "1955 (military time)", "Dude, he wants you to checkmate him, this is no time to be sarcastic.", "'fuck artist'?", "I think your headstone should say 'I did it for the lulz.' ", "Tachikaze is going to be needing some serious skin grafts for suffering a serious burn.", "On the talent scale, 'fuck artist' is somewhere near the top. It's just past 'bitch composer'.", "how can i make a similar joke as you guys? (I'm an idiot)", "&gt; Because she's with Captain Hammer. These.. are not the hammer. newlinechar ", "&gt; The hammer is my penis.", "The silk is even worse of an analogy.", "If this is true I will never make it through this animal behavior unit.", "Most cats know not to extend claws when playing.", "But then what am I supposed to play with in the bath?", "So say we all!", "When our cat plays with my wife he never extends his claws, however when it's my turn 'GAME ON!'", "Jihad me at Iraq'n.", "I don't know why anybody would downvote you.  You have a degree and a professional opinion on the matter.", "Usually pun threads are pretty Shi'ite, I thoroughly enjoyed this one though.", "wow .. while i knew it existed (since it didn't let me use the name ) .. i never thought to look it up.. thanks for that.. now I'm just mad that its a 2 year old account with 1 useless comment.", "I lol'd at that considering how hard she was trying make the spelling look all arab when it's 'Masjid' anyway...", "Someone will ruin it Sunni enough.", "Isn't A-God what they're calling Allah in the hood these days?", "[ಠ_ಠ](http://i.imgur.com/AhUPE.png)", "[TIMES UP JIGGA! JAY HOVA IS OVA!!](http://jayhovas-ova.webs.com/)", "Re-posts of re-posts?", "You know what's worse than re-posts of re-posts?", "The Ebola virus.", "&gt;Someone will ruin it Sunni-nuff newlinechar  newlinechar Just making sure your post Israel enough", "*too", "You sound offended", "it really, really isn't.", "Oman, these puns are annoying.", "LOUDLY*", "That was some mighty fine Guinness you had, but I feel bad.  Here's a Blatz.", "That was a refreshing Shiner in mah belly, heres some Bud Ice to make up for it.", "Some people did that in high school. I never saw the point of cheating, but if I had wanted to, I would have had no trouble whatsoever.", "Hey buddy, your Hoegaarden was too fruity so I replaced it with some Mountain Creek, a classic lager.", "I mean 'Waffles' -- where is أين.", "Use a disposable camera next time.  [Although it does seem wasteful and you don't ever get to see your pictures.](http://www.youtube.com/watch?v=h0TJeocV3S0)", "ONE OF US", "Every young child needs to know the joys of inserting mice in vaginas.", "You looking for a roommate?", "I think it's important for you to know that I went from being completely stone faced to erupting in laughter in less than a second. Thank you.", "That's just what we WANT you to think.", "My navel's novel.", "I want in.", "out is better.", "Out is better.", "But I don't want a new grampa! I want **my** grampa!", "Frankly I'm surprised he didn't skid all over and have an accident when it happened. ", "Gotta tell you, women these days... a little loose.", " wonder if she'll crack a smile.", "If I were her I'd be boweled over by his lightheartedness. ", "You must not date much...", "wow...I'm actually literally sick to my stomach knowing that stupid bitch has her own Wikipedia page.", "But let's not poopoo over the details.", "It was of Lumberjack proportions.", "That's no moon...", "Of all the truly sick things on wikipedia, this one bothers you?", "Interestingly enough, many organisms in the animal kingdom use this strategy to escape.", "Fuck that, roll out maneuver noted.", "considering the familal makeup, this was an All-American slam", "Perhaps one of many.", "TO THE MOONS OVER MY HAMMY", "Exactly. If she's successful, she can be a trailblazer for others seeking to emulate her approach.", "I'm assuming less people take part in drinking piss than waging war, as an overall statistic. newlinechar  newlinechar Wouldn't you agree?", "Well, yes, but fewer people take part in giving cupcakes to orphaned children than do in waging war... it doesn't mean that if you're willing to do one, you should be willing to do the other.", "Fuck that, picking her up maneuver noted.", "And that's what's wrong with the world.", "Thanks, grandma!", "I like how he keeps the possibility out there that his just a crappy date ", "[Octo-porn](http://en.wikipedia.org/wiki/The_Dream_of_the_Fisherman%27s_Wife)?", "`YYYYYYYYYYYYYYYYEEEEEEEEEEEEEEEEAAAAAAAAAAAAAAAAAAAHHHHHHHHHHHHHHH!!!!!!!!!!!!!!!!!!!!!`", "Turbo", "he got the colbert bump. thats why", "Negro", "If she can't afford the rusty trombone, then she should at least make him a Portuguese breakfast for his birthday.", "Ancient Sith torture.", "That's...highly unlikely.", "Sexual Twister For The Lord", "Call me Darth Invader", "Call me Chewy", "Ok.. help me out with this one.. is yoda a dude or a chick?", "Call me Solo. :(", "So then what exactly is this? newlinechar  newlinechar http://www.episdioeo.org/photogallery/Disc%20Cmp%20gamesJPG.jpg newlinechar  newlinechar EDIT: http://i30.tinypic.com/33vc3lx.jpg - **mirror**", "Seriously? You've got Leia over on the other side with a two foot long pink dildo. What the fuck do you care about Yoda, you freak?", "Are you serious? You don't put a beer in the jacuzzi unless you want it to taste like warm urine.", "My name is Lando and I fucked all your bitches. Three times.", "Rule 34 dood", "Why, you slimy, double-crossing, no-good swindler."], "TwoXChromosomes": ["You 90% bastard!", "Raldi, you didn't answer my questions for you in ROTD today. I'm therefore going to have to vote you Least Cool Admin. newlinechar  newlinechar (Jedberg answered my questions; therefore he is coolest by default.) newlinechar  newlinechar `(please don't ban me)`", "Qeraeth seems to believe that foolsjourney is an honest if passionate poster. I'm still on the fence. The last couple of responses I've received are pushing me back towards troll, but... Regardless, I like exercising my 'logic' chops.", "You're welcome.  I know that the misogyny can run rampant here, and the last thing I want is to be accused of it. :)", "Pfffft.  Anyone complaining about misogynistic Amazon ads tomorrow is hereby preemptively declared lame.", "So I guess what you're asking is if we would like to play into sociological expectations or continue being a somewhat radical group of women.", "Sorry, i just don't have a strong opinion on marshmallow peeps.  newlinechar  newlinechar I've rectified the situation, somewhat, though.", "That's ok. Thank you. :D", "Those lazy babies should get off their asses and start contributing more :)", "I really don't like the assumption that because I'm a woman I must have bred. I would much rather see ads for sex toys or clothing over fucking formula and nappies.", "I don't know, I bet a lot of 2Xers would be interested in fucking formula.", "While I cannot promise extreme vigilance, or even a look around, tomorrow if I see anyone complaining about the ads I'll try to emptively declare them lame as well.", "I think this is the ultimate test of reddit good.  Recite your google mantra: Do no evil.", "WHAT THE FUCK HAPPENED???", "I'm never changing it back!", "!! Barbie, where have you been all my life?", "Wait, sodypop is a boy? newlinechar  newlinechar BANNED!", "Why do you hate us??? :(", "Oh, she's been around [for a while](http://www3.timeoutny.com/newyork/the-feed-blog/restaurants-bars/wp-content/uploads/2009/02/old-barbie.jpg).", "o.O Some people are gonna be pretty shattered when they see that even plastic gets grey and wrinkly.", "I'm like 2XC's best friend, with benefits. ;)", "like, *ohmigod*! I *totally* agree with you! newlinechar  newlinechar *giggle*", "It's not much better after a couple of wines. ", "UM LIEK ISN'T IT TOTES OBVI?!?", "it's totally totes presh. ;)", "Upvoted to infinity. Just because I *can.*", "horniness + opportunity = fucking?", "&gt; I'll try to emptively declare them lame as well. newlinechar  newlinechar *glances at user-name* newlinechar  newlinechar I'm sure that's the *only* thing you're going to do. ", "She has said she enjoys having other people's t-shirts, so I am going to give her my university team shirt from volleyball.", "Nope.  Option A here.  But I'm lucky enough to have a stay-at-home husband, so having a child at 22 won't have much (if any) influence on my career.", "I see what you mean, but I think it could also be argued that she's reclaiming the word as something she doesn't need to be ashamed of.", "I agree. That second one is super cute.", "I think women think they love sex as much as men do. I also think they underestimate how much men love sex."], "DoesAnybodyElse": ["K! I'll have them up tomorrow afternoon. newlinechar  newlinechar **edit:** updated ~4 PM EST, 4/1/2010", "Seconding that, wanna see :D", "that sounds awesome and i cant wait to see it!", "Sweet!", "rib-bit is right, I was pooped when I came up with it.", "All of which makes me anxious... at times, unbearably so.", "And she smiles whenever you take a sip.", "To cut costs, I am simply going to wipe my groin and ass with at wet cloth and ring it out into the tray", "good call.", "I'm hoping you mean the little pocket-in-a-pocket in your jeans. Otherwise the alternative is that this is a euphemism for your bottom. ", "yes.", "It's a Costanza!", "Yeah, it's nice to have soft butter for spreading and such. One of [these](http://www.preisnerpewter.com/AC-64190.jpg) could help. newlinechar  newlinechar Also, Yah! for Minneapolis. ", "Xbox Live is a terrible", "Xbox Live.", "['That's black.'](http://www.youtube.com/watch?v=anGkl_ef8FQ)", "That's racist! newlinechar  newlinechar (I'm glad someone got it. More people need to watch that show, so they can stop downvoting me.)", "It was on the [front page](http://www.reddit.com/r/videos/comments/dwm3b/thats_racist/) of reddit, too."], "pics": ["y is a vowel", "Pwnd", "your maths intrigue me", "Nice try, jay lenos writing staff.", "You need to move out of Soviet Russia.", "Blimey, this one's of such better quality/resolution than the one I used. :/ Had no clue what half the things in my reference's background were...", "If you only had some a's, you could have 'padawan.'", "And believe me, I am still employed.", "No, he's a body of rules, principles, or standards accepted as axiomatic and universally binding in a field of study, religion(or science fiction)that is not consistent or is easily changed. ", "Is that fur real?", "It's supposed to show how subservient man is to the machine.  These were posed shots.", "Thats a jib well done!", "I couldn't say. The outcome was pretty pawful, though.", "I concurrent that something's fishy here...", "Agreed.", "OMG", "Nobody's responded to this but- yes.  Yes there is.  It's called a pizza stone.  You leave it in your oven to heat up to an appropriate temp, so as to make the delicious crust when your pizza is slid onto it. newlinechar  newlinechar :)", "Better to be safe than sorry. newlinechar  newlinechar  newlinechar  newlinechar Edit: And the jokes on you, I don't have a job.", "I can only hope this is the tail end of this pun thread.", ":/", "We should start a thread where we draw or write random shit and see what we can get.", "well once everyone has it, that won't be an issue.", "Even MORE diabolical!!  A pro-herpes woman disguised as a pro-herpes man!  Enigmatic and diabolical! newlinechar  newlinechar (also: whatcha doin' tonight?)", "I thought it was because we're not supposed to cry at work.", "YOU WOULDN'T GIVE THE HELMET TO HIS GRIEVING WIDOW", "Yes, you do. ", "Jesus loves me, this I know... ", "I'd reckon you'd slow down in the same place twice?", "shut up dave.", "AND THEN STEAL IT BACK", "He's getting his revenge by rounding that nut.", "An cheaper option is to just buy some unglazed quarry tiles from home depot and put it in your oven. Works the same without the $50/stone cost. ", "Banned. lol newlinechar  newlinechar EDIT: I just upvoted my own comment to ∞.  Suck on that P-Dub.  Oh shit...imma go ban P-Dub.", "I gave you infinity upvotes. Enjoy!", "I gave you infinity upvotes too, I think only the normal amount actually work tho(so only one per post/person).", "Maybe, I used grids when I was (am still) learning, and if someone I knew had produced shit like this with the grid method I'd still be using it. It helps with overall composition and proportion ... but every detail, nut, or bolt (literally)? ", "I gave you infinity upvotes, but when I turned admin off, it only showed up as being 9999 points.  ", "Look down, back at me, it's two tickets to that webcomic you've wanted to see. ", "Usually the grid is called pixels, in this case.", "my spidey senses are 73.33% certain that you are a shill account. ", "Pro Tip:  If you drag the plastic thing to the trash, it'll give it back to you.", "Lenin?! Aww man, I guessed Dracula.", "&gt; Works the same without the $50/stone cost newlinechar  newlinechar The last pizza stone I bought was under $10.  If someone is trying to sell you one for $50 they're really gouging..", "Japan, SpaceCorpse.   newlinechar    newlinechar SpaceCorpse, Japan.   newlinechar    newlinechar Not sure if you two have met.", "RAKAKAKAKA", "Toke, mon. /Jamaican accent", "the puss must flow........ewwww", "that's awesome.", "The story improves with one of the movies. I forget which one.", "Woah.", "Well I'm pretty sure that isn't Kel, so it must be Kenan. ", "smokémon!", "She can grow a venus fly trap and paint it. ", "When I ban you, you don't actually get banned.  Serious bug there...", "thankyou plankton. love the work you do, keeping the bottom of the food chain running smoothly and all.", "&gt;Wikipedia has made college irrelevant.   newlinechar  newlinechar I'm going to print that on a T-shirt and wear it to college.", "IT'S SUPER EFFECTIVE!", "No.", "No shit, Sherlock. ;)", "When I wake up I feel lonely and depressed. Pretty serious bug here...", "The tickets are now diamonds!", "too soon?", "The way the typical redditor interprets photos like this is what's creepy.", "Am I the only one who wants some skilled people to follow this thread and make things go away, little by little? newlinechar ", "Ditto", "Ditto", "Solidarity!", "Ditto", "There's also candles underneath the flammable curtains!!", "...provided Stroud wasn't able to fashion a weapon from scavenged bits before Bear finished narrating his walk across the Thunderdome and attack tactics to his 2 cameramen.", "*can't... resist... urge...* newlinechar  newlinechar  newlinechar It looks like *(puts on sunglasses)* things could get hot.", "Tigers are usually kissing other tigers.", "I don't care. newlinechar  newlinechar How about that?", "YYYYYYEEEEEEEEEEEEEEEEEEEEEAAAAAH!", "Best comment on Reddit I have read in a long time.  I'm really glad you liked the photo.  When I was uploading it I was thinking, who knows, maybe somebody will get a kick out of it. newlinechar thank you", "Fair enough, I'm just pointing out that there seems to be a double standard when it comes to judging peoples' bodies. Calling a person too fat is cruel and malicious, calling them too skinny is observant and constructive criticism.", "Ditto", "What has been seen can not be unseen. ", "Beat me to the punch... I only wish I could download a time machine...", "MMMM YOU'RE CUTE, TOO.", "did you downvote me strictly on the basis of my gender, or because you didn't like it?", "&gt;not that it matters of course since I'm a redditor newlinechar  newlinechar Hey!  Well....yeah....ok.", "we just say “manager”", "doesn't seem to affect the taste...", "&gt;", "Don't you dare use those numbers, the Fortune Cookie in its infinite wisdom chose me to use them. I'm playing the lottery tomorrow and if I win everyone in this thread gets $1000.", "What right do you have to call yourself mister manager?!?", "he's not real. ", "Nice try, John Mayer.", "FFFFFFFFFFFUUUUUUUUUUUU", "Come on!  You blew it!", "You just flipped my world upside down.", "posting here just in case ;p", "It's called '69'.", "This just made me realize the perfect karma-whoring opportunity. 'For every upvote this gets I'll give every redittor in this thread $1 if I win. For every downvote this gets I will kill you.'", "Nah, St. Bernards are for brandy on the glaciers.", "http://www.reddit.com/user/HighFive", "Wanna buy a caravan? ", "Hear hear", "Are you asking how you get a Lingerie model with huge tits to hold your cell phone for you?", "Whatever it takes, man.  Whatever it takes.", "What? Proper fuck?", "When I grow up, I want to be even better than that guy.", "Maybe the dog is just saying 'fuck off' by giving him the cheap beer.", "In the quiet words of the virgin mary....", "When I grow up, I want to be even bigger than that guy. ", "True, but it's intended to be nonsexual and silly.", "With a nuclear missile from orbit...", "12 and autistic.", "OH. MY. GOD.", "Or not.", "Do what?", "In the bathroom would be too kinky", "I still like watching the new episodes. Sure, they're not as great as the ones before and the jokes are predictable, but there's a nice comforting sense of familiarity with the show.", "    I N C E P T I O N", "I disagree...although some of the jokes are OK, they've bastardized the whole thing.  The setting is the same, but the core/heart/soul of the show is long gone.   newlinechar  newlinechar At best, it's like watching high-quality fan art of the original.", "After I saw the picture on my RSS feed. So, 4 minutes give or take?", "Generally some other form of clothing is necceary a well, just a tie and underwear isn't enough.  newlinechar  newlinechar I suggest either a baseball cap or one left shoe. More than that would be overkill. ", "28 or 23 yr old Lisa? lol", "Found this beauty the Archie McPhee in Wallingford, Seattle.  A similar type of place I can think of is Spencer's Gifts. newlinechar  newlinechar Wait, I found it: http://www.amazon.com/Accoutrements-AVENGING-NARWHAL-PLAY-SET/dp/B000J3IU6E", "I resent that remark", "both   newlinechar think about it", "[2015?! You mean we're in the future!](http://www.youtube.com/watch?v=6Tf8mPsvcOs)", "Stupid sexy Flanders.", "...nothing at all...nothing at all...", "i agree. i cry every time. i can have my foot blown off, or my nose bashed in, and no tears...but some dude talking about his sick dog makes me bawl.", "The bumped up the graphics but lost some of the core elements that made it fun. Just like a lot of video game sequels.", "DENTAL PLAN", "Either that or they miraculously beat the highly improbable odds.", "It's okay Father Jack, you sit down.", "So, what are you doing here?", "Lisa needs braces.", "DENTAL PLAN", "Beating 1-in-7 odds isn't exactly miraculous.", "I don't think Fallom realized that you shower in the sink, he should apologize.", "Lisa is Hillary Clinton in disguise?  newlinechar  newlinechar *What else haven't you told me about?*", "I will. newlinechar  newlinechar No you won't.", "Lisa needs braces!", "DENTAL PLAN", "There was one recent episode that struck me as I was watching it 'Hey! This is as good as anything from the silver age of episodes'. And that made me sad. It was a decent-ish episode AND IT STOOD OUT for being non-terrible. That's depressing.", "He deleted it!  Any chance of enlightening me?", "Lisa needs braces", "[Relevant](http://foxnewsporn.com/)", "Semi-related note: newlinechar  newlinechar Does anyone else wish chrome could do quick searching via `/` ?", "Look out! A Three-Headed Monkey!", "You fight like a cow!", "BWOM BWOM", "It was about cocks", "Fuck that noise, PROPER ENGLISH IS BACK BITCHES", "Oh I dunno, just want to play some vidya games with some bros. You know we could bro out or something.  newlinechar http://www.youtube.com/watch?v=3zvTRQr7ns8", "[...that's the joke.](http://imgur.com/JPE3W)", "http://5secondfilms.com/watch/absence_of_the_towels", "Install Vimium. Forward slash to your heart's content.", "Isn't it always.", "You can append '#t=2m40s' to the youtube URL to begin the video at the specified time. This works with any youtube video.", "Separate knobs for hot and cold, that both control flow as well.", "[This one](http://www.youtube.com/watch?v=Z1OCC1GWczo) trumps all others", "*Non, rien de rien* newlinechar  newlinechar *Non, je ne regrette rien...*", "No, it's 'You fight like a dairy farmer' and the response is 'How appropriate. You fight like a cow'.", "meh.  the silver age was *alright*, but didn't really compare to the golden age of episodes", "cue novelty account sockpuppets", "That's somewhere in the UK. I can tell by the license plates and the weather.", "Oh wow....", "Lousy Smarch weather.", "DENTAL PLAN", "You suck, McBain!", "Lisa needs braces.", "He is on digg.", "Yeah I don't believe in anything anymore.", "DENTAL PLAN", "Technically correct. newlinechar  newlinechar `The best kind of correct.`", "The goggles do nothing! ", "Lisa needs braces.", "DENTAL PLAN", "And a tiny green space alien named Ozmodiar that only Homer can see.", "Lisa needs braces.  ", "MENDOZA", "is that donald glover?", "DENTAL PLAN", "Lisa needs braces.", "DENTAL PLAN", "Lisa needs braces.", "I want to hug you.", "That's an awful system.", "Soon you'll be wearing my sword like a shish kebab!", "DENTAL PLAN", "Me neither.", "Lisa needs braces.", "Words of warning: This link just blew my eardrums out. ", "DENTAL PLAN", "They're triplets.  The third is JEOBE ", "Lisa needs braces.", "DENTAL PLAN", "Lisa needs braces.", "DENTAL PLAN", "Yes, in fact maybe I'll make a campaign account, *TwentyOneCharNamesNow*.", "[No, I think he meant a Gray Coal Man'](http://libertypundits.net/wp-content/uploads/2010/04/Coal_Miner_1_large.jpg)", "Lisa needs braces.", "First you'd better stop waving it around like a feather duster!", "DENTAL PLAN", "TIL has a lot of reposts, but there's nothing wrong with the concept. newlinechar  newlinechar DAE, on the other hand...", "Lisa needs braces.", "DENTAL PLAN", "Not even 'shopped. Awesome!", "do you happen to be a girl with short hair?", "Many shuvs and zuuls knew what it meant to roast in the depths of a slor that day I can tell you!", "No, but my wife is very vocal about her love of having short hair. I now find it extremely sexy on other women. I really don't get the reddit hivemind against it (like when showing pics of Emma Watson or whomever).", "i'd fuck her.  ", "It missed!", "I like how his hand glistens when he holds it up. ", "http://i.imgur.com/K5cNa.jpg newlinechar  newlinechar FTFY", "There is no reason to not link to the original. newlinechar  newlinechar Edit: subtle bastard.", "True, true.", "And completely unrelated to a large and moving torb.", "If you have a girl that wears shirts like that, marry her.", "'I'm gonna go home and sleep with my wife.'", "Yes there is. S/he changed it. The second panel now says 'Obama' instead of 'Goebbels'", "Waffles?? Don't you mean carrots? HAHAHA", "Also, please stay off the road!", "Her hair is dry.", "Oh, subtle. Thanks I changed my vote.", "you could drop those things a million times and they'd still work fine.", "That's hilarious.  That's my roommate, and he's constantly being told he looks like JGL.  His quote after reading this comment: '&lt;sigh&gt; Even with a mustache and dressed like Colonel Mustard...'", "I think there's something in my eye...", "you never go full douchebag.", "*Stares ironically, sips Pabst Blue Ribbon*", "Yeah but this guy's posture and body type is spot on. ", "Yah - I was trying to make that comment read like philosoraptor but looking at it now makes me realise how crucial the image is to the meme. Visual meme is visual.", "Who does your taxes?", "I *think* it's a play on the old joke, 'French rifles for sale, never been fired, only dropped once.' newlinechar  newlinechar Not sure how it fits a Russian firearm, though.", "Yes. http://www.youtube.com/watch?v=UB_htqDCP-s", "also a TV show: [IMDB Link](http://www.imdb.com/title/tt0176385/)", "My copy mysteriously disappeared, along with all of my Grand Theft Autos. I had managed to repress the memory of the loss, and am now sad again. newlinechar  newlinechar But I've still got my Katamari!", "Should have offered him a hand job or something. ", "I fully expected this.", "From now on this is how I will refer to that face.", "Top commenter had russian-style stuff. Responder fit the joke to the russian thing.", "Im too young to know about this. ", "it looked like you were outlining mormon porn.", "turn, turn, turn", "And a time to every purpose, under Heaven", "I wish I had now that you mention it.", "This is the saddest thing I've ever read!  When I dressed up as Spongebob one Halloween a few of the older couples said 'Oh look, it's giant cheese man!'", "Either way, dropped when the first owner died.", "No problem, man! Thanks for letting me get the pic! I told you that I'd post it!", "A pat on the back would be perfectly fine (provided it is not after giving him a hand job).", "Gym Leader Misty has been defeated.", "Fucking melvin", "you stole my point you bastard.", "explains a lot actually.", "So you can be in pain when you watch free shit.", "'These aren't the brews you're looking for'", "This dog's been on TV.  A happy animal and well-loved.  Her family was told to put her down because she'd never be able to move around and would develop sores and other problems that would eventually kill her.  They taught her to walk unaided instead.", "from Fontana.", "I bet I could eat a hundred Cookie Monster Cupcakes with cookies in Cookie Monster's mouth... newlinechar  newlinechar  newlinechar  newlinechar ...No, that's not it.", "You must be freezing.", "Vegeta!  What does the scanner say about Cookie Monster's power level?", "How is cookie formed? How is cookie formed? ", "My girlfriend once made me some cupcakes like these. It was then that I discovered the ring in cupcake and she got down on one knee to whistle to a cab and when it came near...", "Yeah.  When I saw it, I was floored.  Everyone's comparison was accurate.", "Is there a cask of Amontillado down there somewhere? newlinechar ", "So ur with ur friend and yur eating a cookie wen the phone rigns. U anser it n the vioce is 'wut r u doing wit my cookie?' U tell ur friend n he say 'my cookie is eated'. newlinechar  newlinechar THEN WHO WAS COOKIE?", "And you can get drunk while concocting your evil schemes", "It [depends on the virus](http://www.linux.com/feature/42031). newlinechar  newlinechar Edit: reddit needs a preview feature!", "Your command of the engrish language is only surpassed by your wit.  newlinechar  newlinechar ", "Doubtful, but there is this spot where the mortar looks fresh. ", "It's the mane talking point at the moment.", "it's the though that counts.", "Shotgun anus.", "&gt; dM/dt kills. newlinechar  newlinechar That would make for an awesome public service campaign.", "Had there been an accident and you the only survivor you would have been eligible for some kind of reverse Darwin award.", "I really don't think there's any excusing the F-150s back then.  They were shit in terms of crash safety.  However, to Ford's credit, they're WAY better now.", "Ath you though, tho thall ye reap.", "I saw a new F150 hit a stop light pole at full speed dead on and the airbags did not deploy. If they are WAY better now did they what explode randomly before hand?", "It would have been a miracle!", "And install a new set of thingamabobs", "If you look at the link to the actual tests scores, you will find that the &gt;2005 F-150s are excellent when it comes to crash safety. The model they particularly picked for the Mini-vs-F150 test was the 2003 model.", "Momentum is generally represented by the symbol 'P'...", "I knew someone would rise to the occasion.", "Massive weight loss is also somewhat deadly.", "&gt;A bus really is a much more practical vehicle newlinechar  newlinechar As long as you don't want to park it anywhere.", "you suck at making puns", "But it was hard to get at first.", "And tweek the watchamajiggers.", "Well it probably won't not affect you anyway so just don't try to not think about it.", "It needs new muffler bearings. newlinechar  newlinechar *P.S. I am a shithead*", "That's gonna leave a mark!", "This thread isn't not giving me no headaches. Don't stop not stopping. Hell, I'm not even completely unsure of what I'm not writing myself anymore.", "I'd hate to blow my own horn, but I can buff that right out.", "if i could blow my own horn, i'd never leave my room", "&gt; did they what explode randomly before hand? newlinechar  newlinechar Wasn't Ford producing vehicles that had spontaneously exploding tires at one point? newlinechar  newlinechar Lawyers couldn't get enough of the stuff. newlinechar ", "no love for kung fu panda? or over the hedge? :(", "D:", "*bursts from bathroom, vigorously firing hand-cannon at suited thugs* newlinechar  newlinechar **Die you mother fuckers!!!** newlinechar  newlinechar  newlinechar BANG BANG BANG BANG BANG BANG click click click click", "*look down at chests, at each other, at wall behind them*   newlinechar *raise guns in unison* newlinechar  newlinechar BANG BANG.", "PB&amp;J on rye? Ew! newlinechar  newlinechar Hopefully his fridge is full of sauerkraut, corned beef, and swiss cheese.", "Why the fuck didn't you tell us someone was in the bathroom? Slip your mind? Why didn't you tell us someone was in there with a goddamn *hand-cannon*?", "You see the size of that gun he fired at us? It's bigger than him!   newlinechar We should be fuckin' *dead*, man.", "I sink we can just move on..", "http://paulgraham.com/segway.html", "I saw it. :)", "I'd be more concerned about the punctuation communists.", "the 'camera' serves as a modifier. the 'phone' is in primary position, grammatically speaking.", "\\*bows\\*   newlinechar I love you Cat", "Could you please show me where he has voted on those opinions?"], "gaming": ["'I fucking put my head through my wall.' newlinechar  newlinechar Best part of it all.", "Did you slowly turn around to the social worker present, hoisted your arms in the air and shouted: 'Are you not entertained?'?", "Zergling Boogaloo", "Modern Warfare 8", "RAMIREZ!! GO GET PROFITS!!!", "Hear this peasants, all developers are immortal!", "don't forget Starcraft Hero &amp; Warcraft Hero, both with their own race variation of games. newlinechar  newlinechar  newlinechar Oh oh and Tony Hawks Pro Zerg Rush.", "Luthor seems like a much more sympathetic guy, actually.", "&gt;Oh oh and Tony Hawks Pro Zerg Rush. newlinechar  newlinechar Oh hell this is an amazing idea.", "Oh man that analogy is too good.", "When someone loses connection to the internet they call it a DC, or disconnect.", "Is this the beginning of a Team Rocket chain?", "You forgot [ArenaNet](http://en.wikipedia.org/wiki/ArenaNet), although that one has been successful so far.", "Interesting, if true.", "Ah, wonderful.  Thank you.", "I got sick. ", "Yup, it even had the mine cart concept and made it fun. http://www.youtube.com/watch?v=Ckxv4ja5jkY#t=2m16s", "That made me sad :(", "At least when Luthor became supreme ruler he did a good job.", "What a relief. I can live forever!!! GWAHAHAHAHA!!!", "And probably the statues of Moai, if they're producing a temple that fast...", "'So far' spanning the last 10 years. newlinechar  newlinechar  newlinechar  newlinechar (unrelated: I'm a Guild Wars hardcore fan.)", "To get rid of Tony Hawk?", "I thought that was just because Spore was overhyped, and disproportionately disappointing.", "A FULL MAILBOX OF PURPLES WITH EVERY NEW CHARACTER", "People read the title and see 'Uh-oh' then they assume things and post without actually reading the article.", "I literally couldn't watch it... newlinechar  newlinechar Seriously, the link doesn't work for me...", "Same here. i bought Battlefield: Bad Company 2 instead.", "$20 convenience fee for your welfare purples please.", "World of DiabloCraft: The Frozen Brood IV", "Those license tests were a bitch. The worst part about them was that they were usually more tough to beat than the races you needed the licenses for.", "and it sounds like he is blaming somebody else for it - 'SEE WHAT YOU MADE ME DOOOO'", "This is a good thing.", "Yeah, they've always been more about finding something others have done and then doing it better than anyone else could've possibly dreamed it could be done.", "Isn't that the problem? newlinechar  newlinechar I have not played FFXIII, and I plan to someday, but 5 hours is a long fucking time for your game to have not gotten fun yet. ", "Uh, if Activision makes major changes to how Blizzard makes games the quality of the games will drop, and so will the sales. ", "As a huge fan of the 3 series, this sounds fucking amazing.", "Slightly more revolting, though.", "I liked when he lamented for half a second and just calmly said 'Why did I just do that?'", "KEEP JUMPING, I'M SURE IT WILL WORK", "You have succinctly described every terrible level in every game, ever. I didn't even realize how much hatred I would have for such a level until I saw your post.", "Fuck everything about that game.", "I have a copy around here somewhere. If you buy me a reddit T-Shirt you can have it. ", "Don't forget, the floor underwater has to be made of slippery ice.", "In hell, the only games you can play are games like this.", "You just have to time your jumps right... newlinechar WAIT WTF", "What about the air bubble you have to backtrack for?", "You get it exactly as they transmitted it, compression artifacts and all. They compress the hell out of it so they can fit more channels in the bandwidth available.", "LT and RT are 360 controls.  The PS3 would have labelled them L2 and R2.  If they make a PS3 version, it may very well use the sixaxis controls.", "[Gah!](http://www.youtube.com/watch?v=8TOkKttTkpo)  newlinechar  newlinechar Effing Tails. Stealing my air.", "Campaign only. The first game, wings of liberty, the Terran one, will have full multiplayer with every race.  newlinechar  newlinechar  newlinechar  newlinechar I'm actually really excited about it. Each race will have a campaign that rivals the size of the the campaign from SC1.", "I cannot hear that music without freaking out. ", "ANOTHER MONTH", "Scorched Earth was actually a really good game, back in the day.", "You know how Dracula feeds on human blood to live forever? Gabe's the same way, just with creme fillings. newlinechar  newlinechar I can wait.", "I was laughing at how bad it is. For a very short time. This must have been made as revenge for something.", "And yet WoW is one of the most successful games.", "Nope.  It's just Tony Hawk sitting at a computer, microing noobs early game, thusly preventing any long term fulfilling game that's worth playing", "I really don't get it...", "Zaal'Koris vas Defrahnz = vas deferens: part of the testes [wiki](http://en.wikipedia.org/wiki/Vas_deferens) newlinechar  newlinechar Zaal'Koris vas Iktomi = vasectomy: male birth control method, minor surgery snips the sperm-carrying tubes in the scrotum. [wiki](http://en.wikipedia.org/wiki/Vasectomy)", "Me either. My pulse spikes a bit, even to this day. Man, I must've played Sonic a ton. Haha.", "Or just click the links.", "Ah, much appreciated! ", "Never played HoN to compare, but I'll leave an upvote here for a fellow LoL player", "He's a lot like your cool granddad who'd always have some cool new toy for you to play with or something really awesome science gadget to show you whenever you visit him on the weekend. I envy his kids. ", "Lets take a step back before this gets out of hand.", "The spring (or aquifer) need to be feed from somewhere, and being surrounded be seawater the only suitable source is the precipitation in that single square. newlinechar  newlinechar But maybe it rains a lot in Portland. newlinechar ", "I've never heard of a vas deferens, but I got it after saying vas Iktomi a couple of times.", "Well Kloster, don't get your hopes up ... you won't see it until they can figure out how to sell that single title for like $150+.  newlinechar  newlinechar Edit: Plus $50/mo. subscription fee. All your credit cards are belong to Blizzard!", "Chuck's Fuck and Suck. newlinechar  newlinechar In case you were completely serious.", "Please be right.", "This, though I'd also be inclined towards the Asari planet in ME2. It's quite pretty.", "someone never took sex ed...", "I still don't know what you're talking about.  You didn't have to escort anyone in the tanker.", "Or maybe English isn't someones primary language...", "... and neither is Latin", "one decent one would be nice.", "Easily.", "&gt; 11:00 AM PDT - Upcoming Deal newlinechar  newlinechar &gt; newlinechar  newlinechar &gt; Experience the battle between High Heavens and Burning Hell newlinechar  newlinechar  newlinechar  newlinechar I'd be surprised if that wasn't it.", "I'm quite proud that yours people have done this! Thanks Holland!", "Fallout 1 is the best of the trilogy, although not the genre you're looking for. I'd recommend avoiding oblivion if you really liked morrowind", "The accent goes the other way in your facè!", "Oblivion is a damn fine game, but if you go into it expecting a better Morrowind you're naturally going to be disappointed.", "Don't be ignorant.  They're speaking Hollandaise.", "**[OBJECTION](http://archives.bulbagarden.net/media/upload/d/d2/Pok%C3%A9mon_logo_English.png)**", "Don't be oblivious. They're speaking un-American. ", "Damn, your facè looks suspiciously like the Pokémon logo. newlinechar  newlinechar Also: There is a slight chance that my accented letters may have settled during shipment and some discrepancies may occur on some screens.", "Yes and puffpuffpass is an old Dutch word.", "Bit of Trivia: The guy who designed that level also designed The Fort Frolic section from Bioshock, which was also pretty damn scary. The plaster statues...", "It's not like people are mating with him, they're clones. newlinechar  newlinechar On second though, that doesn't make it any less scary.", "Yep, and I'm going to complain about your complaining. ", "Mother*fucker*.", "Link's Awakening was awesome.  I'm too young to have played the original, but when I was ten my parents bought me a Game Boy Color and the DX edition. newlinechar  newlinechar I'll never forget Christmas 1998.", "Deus Ex vs Books!", "They must have taken it out. newlinechar  newlinechar http://www.escapistmagazine.com/videos/view/rebecca-mayes-muses/1829-Love-Song-for-Yahtzee", "Racist.", "Deus Ex is a great game, but I'm not sure it's the best example of video games as art.", "Neither is Huckleberry Finn. Also an entire generic class of art vs one specific example of another is always ridiculous... But, alright: newlinechar  newlinechar Passage vs Books.", "Transformers: Revenge of the Fallen vs Modern Warfare 2 newlinechar  newlinechar (actually, I'd pick MW2 which should give you an idea of how much I hate that Transformers movie...)", "Exactly! The medium itself isn't the art. It's the work that goes into it that MAKES it the art. The potential is in the tools, in the medium -- the art is in the creator's creativity. ", "Yup.", "I thought huckleberry finn sucked honestly.  Bored the hell out of me at the very least.", "Most people seem to think video games are still like pong, just competitions between people or the computer. Anyone I've met who thinks that video games are not art haven't actually played any of the more modern cinematic story based games.", "Yup and Twilight Princess is *Towairaito Purinsesu*. Not to far off from the anon's spelling.", "I think a better analogy is actually choosing between Mozart's Requiem and 'a great movie' since they're not actually the same mediums.", "I thought so, but a lot of people actually *liked* Spirit Tracks, so I replied just in case.", "indeed.  history is written in the blood of pacifists and conquered people.", "I'm a gamer - I rack around 15-20 hours a week on new titles, and I think video games are not really art. ", "I loved Spirit Tracks, but it was mainly for the amazing super-fantastic music.", "Damn mohawk grenades! ", "Yep. Reading through the archives at work kills quite a bit of time", "I did play Ocarina afterwards! Playing through the dungeons (especially the one where you use the mirror shield to light up those creepy smiling suns), i thought, 'hey, this feels like Wind Waker,' and then i remembered that i was playing them in the wrong order.", "Ha sweet, did you make it through the water temple? *shudder* I still don't know how i beat it to this day, i think I just kept switching the water levels and repeatedly visiting the same rooms until the game had mercy on me.", "Evil Dead is for purists.  newlinechar  newlinechar Evil Dead 2 and Army of Darkness back to back is better. newlinechar  newlinechar Get em into it, then have them go back to the start...", "I am so sorry.", "Ha!  And they say video games aren't art!", "Are you still Chell in Portal 2? I thought it was a different person entirely.   newlinechar  newlinechar That said, I've been avoiding a lot of the info on the game out there, I want to be pleasantly surprised when I get it.", "No. ", "&gt; cheese head redditor newlinechar  newlinechar Cheeseheadditor? newlinechar  newlinechar Cheers from Denmark!", "It's a bit weird. They called him Ti-duss in Kingdom Hearts 1 and then Tie-dus in Kingdom Hearts 2. I'm still going with Tie-dus.", "'I can't pick that up.  No really, I can't pick that up.  Are you dense?  I.  Can't.  Pick.  That.  Up.' newlinechar  newlinechar Then Sam weeps.", "[Pandemic 2](http://www.crazymonkeygames.com/fullscreen.php?game=Pandemic-2)", "[This](http://tvtropes.org/pmwiki/pmwiki.php/Main/GRatedSex) article is a really interesting read on G rated sex in media.", "Rogue type games (nethack) use that as your char.  ", "Have you seen the trailer? 'Its been a long time'. ", "Thanks mate.", "Yes!!! You just made me the happiest girl alive! Thank you so much! Now I can stop going through every game title I've ever played.", "ditto, I like the version they use in 3/4/peace walker a bit better, but still one of my favorites", "Oh god why would you link TV Tropes. newlinechar  newlinechar Well there goes my evening.", "Close, down, EVERYTHING!", "ZOOM! UNCROP!", "DID SOMEONE JUST FUCKING COUGH!?? OH SHIT OH SHIT OH SHIT", "[Your wish is granted](http://www.3ddotgameheroes.com/)  (assuming you have a PS3)", "Tell me about it. Getting it to run on windows 7 is just a pipe dream of mine.  Some of the best writing in all gaming history.", "A *ambidextrous* black Scottish cyclops? now that's just too unbelievable.  ", "Yes", "but 24 weeks after that noone gives a shit", "ahem... newlinechar  newlinechar http://residual.sourceforge.net/ newlinechar  newlinechar p.s. [ScummVM for the rest.](http://www.scummvm.org/compatibility/)", "This. A thousand times this. And play this before any others. It's only $10 on Steam.", "Their last game didn't have dead presidents in it. That's what I find interesting. The campy premise and over the top characters. The last was fun but this seems like a better, more complete vision. ", "We basically have to nuke it from orbit. newlinechar  newlinechar It's basically the only way to be sure.", "Just a heads up, That's not the G-Man.", "One of the clones, right?", "Fine Whatever.", "I'm talking about the noise you hear (sounds like radio chatter) when you fight the guys with the helmets.", "So it is.  Silly mistake to make, especially when lauding the merits of the sniper.  Guess I've been playing too much TF2, wherein the laser *is* red, albeit invisible.", "Guys with helmets!? It's the COMBINE!! Christ! You talk about this game like you watched your boyfriend play it ;) newlinechar  newlinechar  newlinechar Nice atmospheric apartment though.", "The laser is only red if you're on the RED team. :)", "And it's not invisible!", "'Happy Birthday' is the greatest song ever composed. Most of western culture knows it, and a reasonable chunk of other cultures do to! That must mean it's awesome!", "WeGame. Now with 500% More Facebookery!", "Don't forget post processing a la Left 4 Dead.", "find: Facebookery newlinechar replace: douchebaggery", "So succinct! ", "unlike RJ newlinechar  newlinechar -edit- they are better than some of the crap out there like sword of truth, but stuff like song of ice and fire &amp; the demon princes are better(in my opinion)", "They really did a great job there. The effects they apply are really subtle but work so well. It's nice to see progress in that direction, versus effects like bloom.", "you guys are geeks. newlinechar  newlinechar upvoted.", "/s/Facebookery/douchebaggery/", "Until they grow up and become concerned about real issues. ", "Gordon Freeman! newlinechar  newlinechar Gordon Freeman?", "It's a cult of freedom and openness. Remind me again how this is bad.", "I think you mean you got so excited about cars you became... exhausted.", "I don't think Friends worked from its launch in 2003 until some time in 2008."], "WTF": ["'juggalo'", "His name is Robert Paulson.", "Pecker!  Ooh wait, that's not a woodpecker, it looks like someone's...", "It seems like they knew not to trust the older one", "YES. It's fucking creepy.", "PRIVATES! WE HAVE REPORTS OF AN UNIDENTIFIED FLYING OBJECT! newlinechar IT HAS A LONG SMOOTH SHAFT. COMPLETE WITH...", "NUTS! IT'S HEADED FOR SOME GIANT NUTS! Wait, those aren't nuts. THOSE ARE.....", "... It's a space station?", "Sorry, posted that from my phone.  Here: http://gizmodo.com/5502948/infallible-method-to-get-chatroulette-boob-flashing", "She still can, but she needs to get away from that step-sister, who probably belongs in a juvenile detention center or some kind of psychiatric institution.  ", "nah, i don't look good in leather", "It could be carried by an African swallow...", "I was really surprised by the way the two girls were genuinely empathizing with the little guy. Kids can be really awesome sometimes. ", "TWO BALLS! No strikes! ...What's that?? It looks just like an enormous...", "Now I'm sad.  newlinechar  newlinechar Single just recently.", "Now that's just shear stupidity.", "What do you mean, 'Dyson'? I'm pretty sure Apple was behind every reinvention of anything, ever.", "Wang! Pay attention! newlinechar I was distracted by that enormous flying...", "Willy, what's that? newlinechar  newlinechar Well, it looks like a giant...", "The are unconfirmed reports that the child is indeed not a single lady.", "No, you're thinking of Halo.", "Midgets with chainsaws. Thats not going to end well for anyone...", "pffft.. all bark, no bite.", "Johnson. newlinechar  newlinechar ", "To r/videos newlinechar  newlinechar To r/WTF newlinechar  newlinechar It's legit.", "Totally.", "HOW CAN THAT BE?", "Goddamn H moved around when I wasn't looking. I leave it that way so you don't look stupid though...", "You know, you're not going to believe this but I watched the very same video as well.", "CAR FULL OF MIDGETS!", "Killed two birds with one snake. newlinechar  newlinechar FTFY", "That's just God doing some maintenance work. ", "What video are we talking about now?", "The girls were both born to him and his wife...His son he adopted from Korea.", "I don't think she is empathizing so much as pissed that there is now a crying child next to her which will be annoying for the rest of the ride.", "I think the one at the top of this thread. Not sure. ", "No way, I do that too! I also collect strands of hair from the side walk and mail them to Joe Pesci, whom has only been answering my prayers 50% of the time.", "Those aliens are tools.", "Ok, no need to hammer that in.", "ewww", "Johnson?", "Really? You wouldn't think so -- those two girls don't look that much alike and the one on the left has a darker skin tone.", "&gt;whom has only been answering my prayers newlinechar  newlinechar Who. Whom is used in reference to a direct object. Here, you're referring to the subject of the clause, so you don't add that m.", "*zoom*", "and it was the best... :(", "I don't think she is annoyed. She is practicing her feminine 'men are such dummies' look.", "Spelling iPhone with the diminutive 'i' is a thing normal people can get right if they know how to use the shift key. You don't have to rely on auto-correct.", "Ding ding ding!  We have a winnah! newlinechar  newlinechar I wonder how many of the US's justice problems would vanish overnight if for-profit prisons and detention centers were abolished and replaced by government run centers like in most other countries?", "This pun thread is a cut above the rest.", "Correction, sources now tell us that the young boy can totally be a single lady if he wants.", "My shift is too stiff and my pinkie finger gets sore from using it for long periods (e.g. coding or writing). Do other people experience this? Is this A Thing?", "You are a someone of whom I am quite fond.  newlinechar  newlinechar Is... is that right? Or is that even wronger?", "Genetics and that kind of stuff can be kind of weird at times! There's actually quite a bit of deterministic chaos under the hood when babies are being made! :[", "dirty.", "Huh, haven't seen that one. Was it good?", "Or, you know, just get rid of the corrupt bureaucrats and politicians that are paying the prisons to imprison innocent people. I mean I guess we could address the symptoms of the disease forever, and forget the causes, but, well, that doesn't actually make sense.", "Would you like to elaborate on that?", "Yeah like who the father actually is.", "Yea, my wife had horrible things done to her when she was a child.  She still hurts deeply from it... but is a beautiful woman.", "*bzort*", "That's right. But 'more wrong', not 'wronger'. newlinechar  newlinechar Well... I think that's the bestest way to say it.", "She's a single lady, she's a single lady.", "that's just not right.", "Fucking logic, how does it work?", "Yep. Those words have always stuck with me. I assumed most people would get the reference.", "I did.", "You mean this day?", "I am now rueful! D:", "consulting.", "His name is Robert Paulson.", "His name is Robert Paulson.", "In the words of Peter Griffin... Go on.", "At least it wasn't intentional. Alley was trying to do was show off.", "His name is Robert Paulson. newlinechar ", "His name is Robert Paulson.", "His name is Robert Paulson.", "His name is Robert Paulson.", "if he was it would be glowing white", "He set the pic as the background. It glows *that* brightly.", "Like becoming a renowned Analrapist?", "LEAVE CRYSTAL GUY ALONE.", "Link them then, or unlink the other account you have. newlinechar  newlinechar Sign into YouTube, click Account-&gt;Manage Account-&gt;Link/Unlink", "Why yes, yes i did", "To hell with tip; use the whole thing.", "Yeah I totally don't get it either.", "[deleted] is probably just kidding. I mean, what retard would read the WSJ?? ", "Maybe that's just his way of saying he loves his wife.", "No. News Corp kept Myspace exactly how it was. Myspace's terrible design is what killed it.", "I found a roach in this butthole, call him for me too.", "And then he probably used his real account to post this to reddit and get loads of upvotes. newlinechar  newlinechar What a plan!", "Thanks! Hah, I feel like I really ranted on about this, I apologize if I come across as whiny.  newlinechar  newlinechar Edit: typo", "Call who, the roach? They don't have phones.", "Shit. I regret the choices I made regarding the structure of my previous comment. I shall endure the shame.", "Same here... I work for Advance Publications (not the magazine side) and words cannot describe how shocked I was when I read the headline. ", "Haha, in the valley they were probably actual porn stars.", "I got shooshed during Desperado!", "thatsthejoke.jpg", "I read the WSJ once because they quoted me. Then a friend linked me to a thread on this white supremacist forum where members were attacking me as a degenerate, liberal college student, who wears cargo shorts and flip flops. newlinechar  newlinechar I blame Murdoch. newlinechar  newlinechar /coolstorybro", "Porn actress maybe. But if I didn't recognize them, they're just a wannabe star IMO.", "oh god i looked it up and lets just say im not gonna sleep well tonight :(", "it was on the news the mroing a grill who over-cook three babbys. i am truely sorry for your lots.", "what? newlinechar  newlinechar a DINGO ate yer baby", "I thought it was just about every picture up until the last one.", "Lol, my personal favorite is: newlinechar  newlinechar 'Well of course it's safe! I've always fed MY baby infant formula. It keeps his coat thick and shiny.'", "It's called death.", "Oh oh, what is it? I'm pregnant so I really don't want to look. But now I'm curious...", "*!!!* newlinechar  newlinechar ", "A coworker once told me she had a pair of natural flotation devices.  Discuss.", "there is a whole other paradox with the word 'now', seeing as it takes longer than the instant indicated by the word in order to say it.", "__*[!!!](http://tinyurl.com/56c6sz)*__", " Relax, go with the flow.", "Screen name win.", "[!!!](http://www.chkchkchk.net/)", "Whatever it was, they clearly made the mistake of attempting to fly it underwater.   newlinechar  newlinechar Ah, noobs.", "You should've replied 'Your butt isn't big enough to count as 'a pair' of anything.... wait...  nevermind.'", "I guess [this](http://www.somethingawful.com/flash/shmorky/babby.swf) would be the mandatory link.", "No.", "I like how all the comments contain some variant of omg, baby or !!!", "Isn't logic just one radical branch of philosophy, long disproved by more mainstream philosophers? newlinechar  newlinechar I kid. I love philosophy. It's entirely not a catch-all for things that aren't science but wish they could be someday. newlinechar ", "¡¡¡", "FFFFFFFFFFFFFFUUUUUUUUUUUUUUUUUUUUU", "hahaha, you dumb bastard.  It's not a schooner, It's a sailboat!", "I'd call it a seashell bra. ", "And that's where we get all that free wood from.", "Nah, he was browsing on Digg.", "If it hadn't been for that horse ...", "Logic is the metaphysics of mathematics. The big disagreement come in whether mathematics is relevant outside of linguistic expressions, or hold on, I have a table that needs refills. newlinechar  newlinechar  newlinechar  newlinechar  ", "WTF = Wow, that's funny.", "Tapioca does that sometimes.", "lol me too I was going to complain to the contributer to be more specific about which one was the wtf picture, until I came to the ast one, btw nsfw", "It was only one year. Not a terrible loss.", "Westward expansion was a major cause of the American Civil War.", "I'd contend the opposite is true?", "We redditors startle easily.", "Username. This isn't AOL.", "But we'll be back... and in greater numbers. ", "im drunk tooo! partaaaaayyyyyyyyyyyy newlinechar  newlinechar  newlinechar or is it?", "I'm sober. And alone. And in the kitchen. Yep, it's a party alright.", "The article is entirely too long for what they are discussing. My god, they even throw in some equations.", "It's better than wrinkly in his face...", "CAN A GUY EAT SOME FUCKING PANCAKES IN HERE!!", "Can I join your sober-lonely-kitchen partaay?", "Dude, it's Jim Carrey. I will **not** hear a bad word spoken about the man or anything he's ever been directly associated with.", "Batman Forever", "It IS better to give than receive.", "seconded, newlinechar but now i want to know what it was . . .", "Isn't that the theme song from Poltergeist? newlinechar  newlinechar http://tinyurl.com/c5bjmp newlinechar  newlinechar (Edit)  yep.. it is.  The song is 'Carol Anne's Theme' by Jerry Goldsmith.  He also wrote the scores for Alien and the Omen Trilogy among other things...", "Damn nature! You scary!", "This is why the writers don't give him dialogue in the games.", "Given your username, it would probably be more appropriate for you to be afraid.", "What intellectual response is there to a video of a pigeon eating turtle, really?", "Rule 3: If it's your first time, you will pick up a goat.", "&gt; maybe a cute little bunny newlinechar  newlinechar I warned you, but did you listen to me? Oh, no, you knew it all, didn't you? Oh, it's just a harmless little bunny, isn't it? Well, it's always the same.", "Upmodded for having the best username with which to reply in this case.", "It would be nice to find out:)", "Thats obviously because cows (what you call 'sea cows') are only native to the Atlantic ocean", "His name is Robert Paulson.", "His name is Robert Paulson.", "He downloaded the songs 5 years ago. It's just now getting to a jury verdict.", "I can't stand this any myrrh.", "Hit the nail on the head there.", "You're karmanaut, aren't you?", "What kind of sick fetishist are you, S2S2S2S2S2?"], "politics": ["Behold!!  The awesome power of google: newlinechar  newlinechar [http://www.npr.org/blogs/politicaljunkie/2009/05/is_john_boehner_a_person_of_co.html](http://www.npr.org/blogs/politicaljunkie/2009/05/is_john_boehner_a_person_of_co.html)", "Given the [type of education](http://www.northjersey.com/news/opinions/political_stile/86741292_Tea_Party_recall_shot_puts_Dems_on_offensive.html) they want their children to get, I don't think it matters.", "That's kind of the point of course.", "Yeah, when your audience is that retarded, nothing really backfires.", "Turns out he's a Democrat. It surprised me.", "You aren't a libertarian if you aren't in favor of that.", "The bashing LL's career for some reason really pisses me off and I can't say I've ever liked him in anything. ", "Being a Democrat in Oklahoma is far different than being a Democrat in *ANYWHERE ELSE*", "I wonder who payed lots of money to break our legal system...", "Not really. The soup covers talk shows and reality TV. Tosh covers the Internet. Plus, it's hillarious. ", "Nothing wrong with American cyanide, you know. newlinechar  newlinechar It's the *Chinese* cyanide that kills ya.", "I wonder who succumbed to the money... newlinechar  newlinechar What's more evil, the guy who pays off a cop to not arrest him, or a cop who takes the bribe? newlinechar ", "'Those that live by the sword die by the sword' newlinechar  newlinechar ", "Dude, after the day I've had, I highly look forward to watching Futurama and then The Daily Show.  Fucking Christ, I need that.", "You wish this was true, but it isn't.  I've lived in OK, Georgia, and S. Indiana.  Most democrats are not really liberal, they just aren't idiots.", "If this Cool J fellow sticks with it, he might just forge a career yet!", "It's pretty offensive to call her son a cunthole.", "This I may use.If I use it, I'l add the fact that the Republican Party has lost most support from just about everybody my age because of this. newlinechar  newlinechar ", "Yeah, that was an attempt to be funny. I think it's ironic that political Christians lean toward the most judgmental party platform.", "Christians think they're followers of Jesus, but really they're followers of Paul. They act nothing like Jesus commanded. Instead they act like the sexist homophobic racists that Paul commanded.", "did you miss his sarcasm or did i miss yours??? =P newlinechar  newlinechar in any case, great find. I'm amazed that those two guys knew that. ", "Yeah, don't make me ban you.", "Deep Blue?  Isn't that the one with Ladies Loving Cool James and Sharks?!?!  Classic.", "Not merely deceptive practices, but deception to market a political candidate. ", "Hey, wait a minute....", "Upvoted to infinity and beyond and then banned for proper novelty account usage.", "Your mother was a hamster and your father smelt of elderberries!!! newlinechar  newlinechar OHHHHH SNAP! WHAT NOW?", "Too far, man. Too far. newlinechar  newlinechar **YOU'RE BANNED!**", "Joe Biden basically exists to make his boss look cool and reserved in comparison. Not that Barry needed any help on that front. newlinechar ", "Mr. Stane, one of the world's most powerful arms dealers, is a socialist?", "Nagger.", "I love lamp", "25 bucks for a politician?", "Yeah, I think this is an excellent quote, illustrating an excellent point. This should be heard everywhere.", "How odd for one to preach about inner beauty when one has only seen the exterior facade that she displays for the public... newlinechar  newlinechar  newlinechar zzz", "Probably. Expect him not to say he was wrong.", "Assuming no government figure decides to significantly reduce the damages. But, I'm sure that couldn't happen.", "Or, ummm, the seizing and holding hostage of US diplomats on an embassy compound?  Embassies are considered the sovereign territory of the state they represent.  Therefore this was an invasion of US territory.", "What exactly is the problem with our current proposition system as is? I'm not trying to argue a point here I've just never heard it brought up and I'm genuinely curious.", "TRICKLE DOWN!!!!", "Alex Jones, Matt Dillahunty?... WHO IS IT, MAN?!", "&gt;D'oh! newlinechar  newlinechar FTFY", "Man, I can't get anything right!", "See Dick Cheney and His Energy Policy Review Board this Friday at 8:00! Tickets $15, $20 at the door! Playing their hit singles 'Sneer' and 'Heart Attack Can't Stop Our Love (Of Shitting On The Poor).'", "I wish they'd do 'Thought He Was A Bird' more often.", "What are the corporations that control the NYT and LAT?", "Maybe she's just a doctor whose name is Pepper and was born in 1965 newlinechar  newlinechar ASS.", "&gt;that especially the prestigious New York Times is bias**ed**. newlinechar  newlinechar FFS", "Advertisers", "Here. Have a sugary carbonated beverage. It will calm your nerves.", "One more reason not to go to that appartheid hole.", "I'm sure with enough convoluted logic, trying to end the 'war against terror' is aiding terrorists and thus a crime.", "I support the filibuster because it prevents dramatic quick changes in government even though I disapprove of how it is being used currently. Think of an idiot like Bush facing a Congress without filibustering powers.", "....or Sarah Palin", "Ah yes I hadn't thought of that.  Maybe that is a good idea.  It's a little more complicated to explain though so for simplicity sake I will continue to tell people to go to the polls and vote for no-one.", "Not sure why that got downvoted. Fixed.", "Well, we socialists are evil personified after all. ;)  (thank you)", "It is a case for all sundials. They are inaccurate for up to something like a two hour difference if you set it on summer solstice and then check it again on winter solstice. ", "There will be a tear in the earth's logic fabric", "From some portions of the populace, he will.  But not from his peers.  He threatens the status quo.", "Although I have no evidence, I'd be willing to bet an audit of Fort Knox would turn up somewhere around 0 oz of gold. ...just a hunch..", "Although he came in 3rd place at the straw poll. ", "THE RAPTURE", "It's like Gilligan's Island... newlinechar  newlinechar ...wait, no, that would make Joe the professor and that's just fucked up.", "I keep waiting for them to ban silverware - forcing their entire population to wait in lines to check in the family heirlooms for their weekly supply of plastic crap.", "Are you actually under the delusion that Milton Friedman *agrees* with Ron Paul????", "You still have to go to a special clinic and pay $200. newlinechar  newlinechar  newlinechar  newlinechar Your normal Kaiser doctor won't do it unless you have HIV or cancer.", "Atlas shat.", "Actually, Fort Knox has plenty of gold in it, in rooms designated as 'Belonging to Sweden,' 'Belonging to Denmark,' 'Belonging to Switzerland,' and of course, 'Belonging to China.'  newlinechar  newlinechar The US reserves, though, are pretty much gone.", "Yes, but then I can refill my prescription bottle with cheap schwag from the Mexicans down the street!", "Tell me about it. This is the third time I've seen this article linked on reddit in the past few days and it's the most misleading and stupid of all.", "Everybody wins!", "Mr. Miyagi?", "Our immigration problem is solved!", "Yeah, I almost hit the block just because.  Today's been rough.", "Fuck him then! I want real change. Skynet would read reddit. Skynet would read everything. Skynet for president! newlinechar ", "So long as Skynet's platform includes Summer Glau robots..", "Damn straight!", "Dude, you would totally understand how gnarly Hitler was if you had seen the holocaust *on weeeeeed*!", "18000 per year according to Medical association.  newlinechar  newlinechar Thats what, 6 9/11? Where is the outrage? newlinechar  newlinechar USA! USA! USA! newlinechar  newlinechar Oh thats right, they werent stockbrokers, just poor fuckers.", "Exactly Osama Bin Laden should have invested millions in the health care industry since they kill and bankrupt more Americans than any number of planes flying into financial landmarks."], "AskReddit": ["I bet every guy wants to party with you now :)  ", "...be a gentleman...be a gentleman....be a gentleman....", "I thought it was rather obvious he is saying 'Stop Saying That' but more of a 'Stop Sayin' that'", "So true. I may or may not have a staring problem...I can't help it boobs are distracting and nice to look at! And I'd identify with a more hetero orientation, girls don't interest me romantically, but golly they sure are purdy.", "I am speechless; and busy for the next hour or so....", "Oh she is.  BIG TIME.", "I'm bi, so not gonna lie, I get a particular pleasure out of a nice rack. Even so, one of my hetero friends told me she liked breasts because, artistically, they're pleasing to the eye. newlinechar  newlinechar If anyone catches me staring, that's my excuse.", "&gt;You sound annoyed newlinechar  newlinechar FTFY", "We can accept for ourselves, thank you. Share the joy.", "To be more accurate I should have said (34)D+. Alas, I am not that witty.", "Go on ...", "LOL. I should try that sometime ;) ", "I think you are just sceptical of compliments because of the amount of self abuse you put yourself through regarding you miniscule penis.", "well i guess i'm also proud of my ability to not be a cunt on the internet.", "An ocean of boobs. I'm imagining guys diving in, a la Scrooge McDuck. newlinechar  newlinechar  newlinechar  newlinechar Edit: And now I have the Ducktales song stuck in my head.  ", "Is... is this what heaven feels like? Warm, supple, and nipply?", "Sorry, this thread is for MILD super powers. This is superhuman at the very least!", "No. The priest acted like he didn't hear me, the friend started laughing hysterically and my father looked at me with death-eyes and said in a normal speaking tone: 'You have just embarrassed your father.' newlinechar  newlinechar We never spoke of it again.", "Jeez, now I am starting to feel guilty that I do have boobs.  ", "Full out Denim", "hahahaha newlinechar  newlinechar edit: it took me like 10 attempts at reading what you said to figure out what you meant, thats not saying much about me is it =(", "BECAUSE OF COURSE THE LOGICAL NEXT STEP FOR REDPANDABEAR, WHEN PRESENTED WITH SUCH A COMMENT, IS TO SHOW US A PICTURE OF HER IN-NO-WAY MISREPRESENTED BREASTS", "honestly, when you have a c or larger (sometimes even a b) on a small frame and you wear even remotely 'stylish' shirts, you're showing cleavage.  We don't necessarily want you starring, we're just trying to wear normal clothes because, you know, turtlenecks don't really work in the summer..", "hip hip, champagne, and all that. :)", "Truer words were never spoken. Ladies, [Let me introduce you to your second favorite website](http://imgur.com)", "At first I thought I was going to go insane. But when I started the audio books there were some drives that I didn't want to end because I got so into them :)", "I think they must just be talking about race selection in Starcraft.", "OP just wanted tits.", "That was not sarcastic! You actually meant it and hoped for it.", "Wouldn't they sting as they wacked your face as you flew? newlinechar  newlinechar THWACK THWACK THWACK 'Ow! Gooddammn it, mon!'", "YOU MAKE AN EXCELLENT POINT; A FEW MEN DO SOMETIMES ALLOW THEIR GAZE TO STRAY SLIGHTLY SOUTH OF A WOMAN'S NECKLINE, BUT ONLY IN CASES WHERE SHE HAS SOMETHING ON HER SHIRT, SUCH AS MUSTARD, OR BREASTS", "The pit in front of Sparta was *not* that deep!", "Read this man's username before you comment.", "who wouldn't newlinechar ", "For whatever reason, nothing is hotter to me than 'underappreciated'.", "That is why it's so funny. ", "He's a WITCH!!!", "Wait then what's their first -- oh.", "66% now.", "You know, you would lose your place in the queue.", "Upvoted for going outside the reals.", "literally", "It would be 66.6 % if computers were powerful enough to computer out that far.", "I laughed, but upvote for learning. Knowledge is power.", "BURN HIM!", "the stupid machines will never learn about significant digits", "LOL sounds like something that could have happened to you if you got hit by a car in that area... you got 'kzing'd' ha ha", "Black jesus agrees. newlinechar  newlinechar So does his apostle, DeShawn.", "I't at 67% so I downvoted", "or dabble with satanic digits.", "upvoted for being adorable", "I feel cheated.", "It's because it makes you think you have a chance.  You don't.", "Solution: 'You have cute elbows.'", "Reddit sweet spot.", "That's a myth!", "Please enlighten me on this comment. I am not completely familiar with all of Pascal's accomplishments other than the triangle and his work on pressure. ", "And it sets near Flagstaff.", "Yeah... 'hour'", "He better try a stack then.", "Me too. newlinechar Edit: went down to 65% so i upvoted.", "Haha, never really thought about that. Either I noticed he was smiling and figured he was at least kidding about that, or I was a cold-hearted little bastard", "It's OK as long as it was non-sexual and silly.", "Tree lovers are just overly optimistic. ", "When he said 'father' was he referring to himself or the priest?", "Word.", "We share the same philosophy good sir!", "No, his was about 2 inches erect, apparently. newlinechar  newlinechar Read this [NSFW I guess]: newlinechar [http://en.wikipedia.org/wiki/Human_penis_size](http://en.wikipedia.org/wiki/Human_penis_size) newlinechar  newlinechar ...and watch this [obviously NSFW]: newlinechar [http://yarravillepaul.blogspot.com/2007/02/small-penis-competition.html](http://yarravillepaul.blogspot.com/2007/02/small-penis-competition.html)", "And set to the Ducktales theme, yes. newlinechar  newlinechar  newlinechar  newlinechar Ducktales, ooh-OOH-ooh.", "Butter is pretty magical.", "STEVE HOLT!", "Until you get little baby porcupine spines spearing your junk.", "Awesome. I'm going to upvote you into infinity.", "Nah, use a heap. Shorter people should always go first. It's common courtesy!", "Same here, Floridian.  I went on vacation in Europe with a group of kids from the midwest and they all FREAKED about spending time at the beach.  What a wasted day on vacation! Go see the sites, not a giant puddle! ", "\\o/", "those are stored as strings.", "&gt; porcupine spines newlinechar  newlinechar Porcu-*spines?*", "'Word'.", "Is this a guy raising his hands, a girl's open legs? ", "[I think we may be onto something big here...](http://imgur.com/VgWC5.png)", "Context is important with this one.", "You feel cheated; 56.45% certain", "In my mind, it doesn't matter if you're doing 70 mph or 150 mph when you dump it.  You're totally screwed either way.  In fact, the biggest risk decision is getting on the road with cagers in the first place.", "Except you get IPs, which if not phony could be a sizable privacy issue.", "Anyone else whip out their calculator and vote accordingly to make sure that it was even closer to that magic 66% value?  66.08% wasn't quite close enough for me.", "Yours is 178.208.220.15. What's mine?", "haha max upvote!!!", "SamuraiBanned!", "Sorry I could only upvote you infinity.", "80.219.149.135 newlinechar  newlinechar You're from Switzerland, apparently.", "I eat rabbits like a vegetable.", "...be a gentleman ... SHOW US DEM TITTIES ... be a gentleman ... oh shit. newlinechar  newlinechar /shame", "No", "Bozarking...", "SO CAN I!!!!! I'M NUTTING KARMA ALL OVER  EVERYBODY LIKE A FUCKING BUKAKKE VIDEO!!!!!!!", "Well, that made me feel pretty awesome", "Agreed. The imagery I have in my head of a nearly comatose old man in a rocking chair with his mouth wide open and eyes sunken, devoid of life, making that noise into an old rotary telephone is freaking me the hell out. ", "NO MY LIFE SUCKS PLENTY THANK YOU", "X-Banned!  And upvoted to infinity!", "That's why the sand there is so red.", "WARNING! Your computer is broadcasting its IP address!!!!!!", "Well, depending on which side the of the pulse the MCU is set-up to be interrupted on, that could be the case. ", "This was me too. Making out = making babies.", "Ninjabanned for questioning my admin power.", "MARY JANE??? YOU WHORE!!! newlinechar  newlinechar WE WERE MEANT TO BE!!! newlinechar  newlinechar *Emo Sobs*", "Thanks for passing that image on to me...", "It's two years later.  I'm 22 and I regret it.", "Unfortunately, only you can see it. lol.", "I just upvoted you ten times for that comment.... but I wonder what happens if I upvote you one more time?", "Don't say that!  Let me just pretend I have all this power for a little bit longer.  Don't ruin it with your truth and logic.", "you have just been upvoted to infinity. see it?", "i also feel like this is turning into a karma circle jerk", "I actually didn't do anything either. I clicked 'admin on', and then I just went about exploring the administrative features.. but I didn't randomly ban anyone.", "O_O", "Broadcasting? To who?  newlinechar  newlinechar *Cue massive warship appearing*", "Now look at your page, now look back to mine, now look back to your page again, now *back to mine*...", "Sadly your Karma is not mine", "but if you go swimming around in an old pond, you could smell like me", "Upboats all around!", "I've been burned a few times. It's not that remarkable. Just look at how a non-black person burns, but lessen the effect.", "I would like to purchase a dozen of your miracle elixirs for the askew Lil' Teamster! newlinechar  newlinechar Will tuppence suffice, sir?", "QUIT YELLING AT HER BOOBS!", "You 've got my [upboat!](http://imgur.com/NN58I)", "I will take that guilt off your chest", "(clear your cache)", "Or else someone was ugly and had bad vision but other people with bad vision couldn't see well enough to tell.", "Holy crap... that almost makes **too** much sense!", "He bought that lambo for $20 less than the list price, I'll bet.", "Why don't you ever believe in me? I bet this has something to do with your ex-girlfriend. She was a bitch. I am not your ex-girlfriend. Just because she let you down doesn't mean that you shouldn't support me in my cause.  newlinechar  newlinechar Asshole. ", "Whom newlinechar  newlinechar ftfy. Hahaha this feels great, no wonder people do it. ", "javascript:(function%20w(){var%20u=$('.up');if(u.length-1){setTimeout(w,1000);u[1].onclick()}})()", "If we downboat someone, are we disrespecting those who perished in the Titanic?", "[Downboated!](http://declubz.com/blog/wp-content/uploads/2008/09/titanic-adventure-slide-1.jpg)", "Clear your cash. This is a hold-up! Give me all your monies. $$$", "FUCK YOU ASSHOLE newlinechar      newlinechar p.s. april fools", "It is.", "Smarmy bastard", "It's like it knows something we dont… yet", "You're doing it wrong. newlinechar &gt;Lrn2 quote", "MONOCLE IS MONTHLY YOU DUMB BROAD!", "I do say! That is not the language befitting of a gentlemen! I will have to ask you do leave my house sir!", "See my hat? 'Twas my cat.", "What is your definition of 'consciousness'? newlinechar  newlinechar Edit: Downvoted for asking for clarification? Real nice, guys.", "Chinese people? You're just going to get hungry again in 30 minutes! They're not as bad as Hispanics though, oye; the runs those guys give me.", "Do not try to go here unless you have a Japanese friend or ARE Japanese, as refusal of entry may offend.", "Downvote me for opinions, not for sharing my experiences, which actually do contribute to the conversation. I only presented facts...though I can understand why you people would get upset.", "My evening wear, vampire bat.", "No you don't know. It's not a Jap soap, it's an open BJ bar. No friend needed. All the girls are Chinese anyhow. Good beer,  vids, blows.", "WHAT?", "WHAT KIND OF DRUGS DENNY?", "STOP GANGING UP ON ME! YOU'RE NOT MY MOTHER!", "Which, oddly enough, tastes like a small hamster. ", "Socialist", "Conservatives.", "In Switzerland, you're allowed to test the effects of LSD on humans.  Trip out!", "They're researching how to restore the hearing now.", "This is true.  Plus, even plants and bacteria will respond and move towards external stimuli.  If chinchillas didn't do this they would officially be the dumbest animals on earth.", "Yes, because you're a scientist who knows exactly what their research entails. Right?", "Protip: the trick is not killing them.", "the problem here is that your standard of comparison is itself non-standard. Whereas you pronounce bars like bahs we pronounce bars like cars; which of course you pronounce like cahs and so on and so on.", "And extinct. ", "You make a valid point. ", "Not everything is dangerous, but everything needs to be tested.  I'm assuming these aren't high risk drugs since they're using dogs instead of pigs or apes.  ", "Defredenburgh. Some kind of protest or march is going on the street right now. A large group of girls is chanting 'No more date rape!' and 'We own our bodies!'", "I will upvote you to infinity if you hang out the window and shout 'show us your tits!'", "I think you missed it by about two minutes. They went up rugar towards memorial.", "Oh.  That explains it. newlinechar  newlinechar What floor on dBurgh?  I was on the 10th last year, 8th semester before that, and I'm an RA on 7th Hood now. :)", "Ha. But yeah: I'm making a meta comment here, to stop this before it even starts.", "I don't think he/she is - this is a surgery they offer to Husky owners, too, so I wouldn't be surprised if they do this at labs.", "I didn't understand *before* it was cool.", "I bet I could make a hundred meta comments.", "[And even more](http://improveverywhere.com/images/desk09.jpg)", "Hearing a dog 'bark' after getting this surgery is a little heartbreaking :C.", "I didn't understand it in vinyl", "Male actually. Dastardly as in 'Why didn't I think of this?' ", "Chicken selects are pretty good. Don't be a fucking snob. ", "Agreed. I have never forced my dietary views on other people, ever. But when I tell people I am a vegetarian, and they just won't stop giving me shit, I take it as an invitation to go after their religion. ", "i picture you twisting the end of your handlebar mustache between your fingers as you say it.", "No, I'm from Facetious.  ", "I would buy it if the name was 'Grand Theft Cycle'. I think it sounds better and I would demand the ability to toss prostitutes on my pegs and take her back to my parents house for some hot sexing. ", "I just hate knowing what someone is going to say and then having to wait for them to say it.", "'BAM! Hit them little niggas with a freezepop!'", "5- Go out grocery shopping", "It's not held together with corn starch. They use Transglutaminase, which is also known as meat glue. ", "[YOU ARE TEARING ME APART LISA](http://www.youtube.com/watch?v=Plz-bhcHryc)", "Replace girlfriend with raccoon corpse along side of the road and I'm right there with you.", "Yee-Row", "Screw.......................................................................................... newlinechar  newlinechar .................................................................................................. newlinechar  newlinechar .................................................................................................. newlinechar  newlinechar .................................................................................................. newlinechar  newlinechar ............................................................ you.", "Also, Charles Xavier.", "I'm in college, I can't afford real food.", "I'm from South Carolina and I knew where you were going from the word 'actually'.", "Wheres that?", "You should be a pro gambler if you read minds so well. ", "I'm so upset that this comment is hidden by default. [Golf clap for you](http://forthehealthofit01.files.wordpress.com/2010/03/golf-clap.jpg)", "maybe you should make out.", "I wish... no he was just like dude wtf are you doing?  Taxi's here. Get dressed. ", "&gt; *(slang)* newlinechar  newlinechar Plus, it sounds ridiculous.", "Don't forget [Sterling](http://www.youtube.com/watch?v=ea7bj5MsyAU).", "About a mile or so from Notserious, and a block or so away from flippant. ", "If I say it and you understand its meaning it's a word. There was a time plus wasn't a word either, it likely sounded ridiculous. Language evolves and changes, get over it.", "Replace along the side of the road with in front of my entire extended family at a family reunion/barbecue and I'm right there with you.", "Um, did anyone die after you left. ", "You should know that signal jammers are illegal pretty much everywhere, and can be dangerous in the event of an emergency (they'll block calls for help, and can also interfere with communication among emergency personnel). newlinechar  newlinechar  newlinechar  newlinechar That said, it's *incredibly* tempting sometimes.", "[Howmuchisitthat'llbeeighteendollarshereyougokeepthechangehidoggieyou'remyfavoritecustomerthanksalotbyebyebye!](http://www.youtube.com/watch?v=7S9Ew3TIeVQ#t=0m10s)", "I think they should make out.", "Or as king richard in Robin hood men in tights.", "No, if that were the case, I'd do this newlinechar  newlinechar http://www.reddit.com/r/AskReddit/comments/ckes1/how_do_you_know_if_someone_is_the_one_have_any_of/c0t6y0x", "Larry David is a real person.", "I never saw the people again. I was very depressed afterwards knowing that shit like that actually happens. I think I cried. I don't remember it much. ", "Hearing people refer to one 'New York' accent annoys me as much as hearing people talk about one 'English' accent.", "I think an IAMA is needed.", "Or Patrick Stewart.  I mean, come on - that guy's got to be made up.   newlinechar  newlinechar Nobody can pimp that much with a chrome dome.", "I would love to see your business card.", "I think they should poop back and forth forever.", "yes, but he plays his fictional self in CYE.", "When I'm trying to speak to someone from France, I always speak very slowly, then...PUNCH THEM QUICKLY IN THE NECK.", "Sex chat would be hotter.", "eh so did I!", "just talk it through with your internet friends.", "Wait though...lemme finish this text. ", "actually to me bruce willis is fictional! as i only know him as a complex melding of all the characters i have seen him play. ", "Don't leave the children on their own", "That is one of the best ways I've ever heard of to tell someone how to pronounce something using text.", "This could vary with location.", "Is there any way I can find the info on where it's illegal? I'm oh-so-tempted to purchase it for my high-school classroom (I'm a teacher).", "Larry David IS George Costanza.", "So here's my challenge - can you make your lectures so interesting that students would rather listen to you teach than text? I mean, sure you're gonna have bottom 10%ers that won't listen no matter what, but you should be able to suck most of them in. ", "Until you eat a mcdouble, anyway.", "Tell me more about this beautiful place", "We don't have a prestige dialect beyond the 'I have no idea where you grew up' accent. If people don't know where you're from, you're perceived as not having an accent.", "Rednecks do not eat roadkill. In fact, they have a whole culture of outdoor grilling I'm still trying to wrap my head around as a Southern male.", "I know, it's only the second ranked response on a page with a multitude of choices! Ridiculous! newlinechar  newlinechar Edit: Shit, now it's only first!", "Don't tell me what I can't do!", "i'll leave it blasting them in the face.", "I don't understand the down votes of this comment.", "HOW CAN SHE SLAP ME?", "Mmmmm. Meat glue. (drool)", "He survived perfectly well. We were friends for nearly two years after the incident.", "...is the same character.", "We can, we just need ovoid blue pills.", "Well, it was written in Rorschach's voice.", "Worse? Maybe I'm warped but I feel bringing torturous harm to any animal, dog or human, is pretty much as bad as it can get.", "or black", "Yes, worse. Killing an animal for no good reason is a terrible thing, but doing the same to a human is *far* worse.", "Rorschach don't use no articles.", "Anyone who would do such a thing doesn't deserve to be classified as a person.", "Word to the wise: do not Google the word 'deglove.'", "Absolutely. Anything HBO really.* newlinechar  newlinechar `* Sex and the City is the exception.`", "I originally wasn't going to look it up, but when you mentioned it, I fell for the reverse psychology voodoo.", "Idiot, you can already see Nascar on TV.", "Purple and green.", "I understand, but this was the only way that I could watch myself doing it. ", "Which one?  Five bucks says that Will played Prospero in The Tempest.", "&gt;Car wrapped around signal pole. Didn't see accident, just aftermath. Head from one of people 100ft down street. Very bloody scene. (short pessimistic rant about how humanity is filth)", "Ah yes, i forgot to clarify that one! Trying to cover up body odor with cologne is a BIG no-no as well.", "Worth mentioning, it's also a spinoff with a rather different feel, so the fanbases of the two shows aren't necessarily the same.", "Fear not, citizen, there are no time paradoxes here. If, however, the invention of HD camcorders was caused or even remotely inspired by cshov and his anachronistic HD camcorder, *then* we would have a problem.", "Everybody thwarts 9/11 on their first trip.", "A plan so cunning, you could put tail on it and call it a weasel.", "[And yellow!](http://images.pictureshunt.com/pics/b/barney_and_friends-10880.gif)", "Awe, thanks. It was the worst night of my life and I've been through some shit. She is fine now and had only two in a 7 day span. She'll be on meds the rest of her life though.", "Best Answer", "That brings a whole new meaning to legionnaires disease.", "DAT ASS", "or when you really have to pee.", "gah. even the stauchest atheists say he's a real person. let's /not/ get into the 1984 'this person does not exist' thing.", "For those curious: Apparently you can 'de-condom.' ", "I bet it's called Sex Panther, am I right?", "Sex Panther: It comes in a bottle, so you don't have to.", "DAY MAN!", "yeah.  fedoras are worn exclusively by hipsters nowadays", "good times.", "5-10 minutes, I'd say probably not.", "Yes.  Claiming things *aren't* ironic is the new popular fallacy.", "it's like raining on your firefighter.", "You disapprove of bowlers?", "I have contributed to the upvote tally. You are welcome.", "No, fuck that. Provoke the crazies. Seek legal revenge if anything happens. Profit. newlinechar  newlinechar Note: Yeah, shit can still go awry. Whatever.", "Yeah, I read it in a Bostonian accent and heard Nascar as well, except someone from Boston said it inside my head.", "Also worth mentioning, Torchwood is for the most part a horrible show, the exception being a few episodes and the Children of Earth miniseries.", "Those will do.", "140*2.2  newlinechar  newlinechar Get used to it.", "Killing humans is worse but animal cruelty pisses me off just as much if not more. ", "Don't be so naive, the bones were planted there by the Devil to test our faith.  ", "how does one make those blue lines next to the comment in order to show quoteation? newlinechar  newlinechar sorry if this is out of topic, but i had nothing to say but this.", "I think that's what RobeMinusWizardHat and I are trying to say without quite saying it :/ Since there presumably exist people that like Torchwood. newlinechar  newlinechar Basically if you happen to have seen Torchwood, don't let it turn you away from Dr. Who.", "That's like degloving one finger right?", "Yeah but growing up in Nigeria sounds like a worthy IAMA post. It would reach a wider audience. ", "'No guys, its real... I went back in time and video taped it!'", "Time machine. Interview a few people, then do a time lapse (1-photo every 3 years or so) video of the construction. You don't have to film the whole thing in real time. And if you miss something interesting, just hop in your machine, go back and film it.", "It was all downhill after his xbox got banned.", "BUT THEN WHO WAS STORY?", "I never have enough cash to worry about kilo conversions.", "my bad, not sure why I thought that...", "&gt;It would reach a wider audience. newlinechar  newlinechar No, it wouldn't. Pics has 210,000 subscribers. newlinechar  newlinechar Plus, IAMA is often full of shit.", "You have an camcorder and a time machine, and you people are thinking, 'oh, but X person might not/does not exist'. Um... even verifying that they don't exist would be okay.", "It's to do some damage to him..not what you're thinking...perv.", "On your estate.", "Upvote for advanced vocabulary.", "Yeah, I actually remember footage of a dog getting shot and still taking a guy down. Dogs are nuts. And I love them for it.", "I have been watching this ALL FUCKING DAY", "Joseph? Yea...You know how we've never made love? YEAH!!!! Yeah, well last night an angel visited me..and now I'm pregnant. JESUS CHRIST!  OH you already know about it...", "I meant wtf as in thats disturbing, I always feel the need to be cautious about the people around me and my dog. you never know.", "props for having the balls to admit that on reddit. them haters hate christians for hating. what they can't seem to figure out (some of them), is that they'd have a better case if they didn't hate so much themselves.", "It's cool; the camera is **HD**.", "Upvote, vomit.", "can we take it back? can it be worn in defiance of hipsters?", "Every single girl i have ever liked with any amount of passion has a song... newlinechar  newlinechar So many good songs, now all that music sounds like is a beautiful melody of *sad*.", "Why does this image move, its fucking me up.", "You only need two bullet points. A dog is part of the family.", "Whoa man we didn't know it was like that.", "If you need advice on weed, go to /r/trees", "I thought this was a Dexter's Lab reference, but I really don't have any Steve Martin knowledge.", "motherfucking .gifs, how do they work?", "Oh neat!  His neck is all stretched out!", "Looks like its just me and you who think so.", "I was so grossed out by this and almost barfed, but then was saved by the laughter caused by your comment. Have an upvote.", "[*] WARNING: People actually believe this.", "&gt;iamatfuckingwork newlinechar  newlinechar You better stop surfing reddit!", "I meant the mormon doctor, not you bb!", "ETC! THREADCAP! INFINITY!", "Pretty sure the Dexter's Lab bit is a reference to Steve Martin", "No, that's 'pass the fish.'  Pacifistic is a Mexican pilsner-style beer.", "I wasn't aware that this was a thread that anyone wanted to win.   newlinechar  newlinechar PS: I agree. He wins. ", "I have never tired of playing Sid Meier's Millinery Tycoon.", "No, Jesus doesn't speak Mandarin. And he doesn't even speak Spanish that well, either. He was born in Phoenix, he just pretends to not speak English to fuck with people.", "I never actually said I was a Christian (I am, as it happens) -- just a creationist. Fun times ensue.", "smoke is the problem, not fire.", "It always ends in tragedy.  No matter how open minded you are; eventually you get fed up with her lounging around the living room in her G-string for everyone to see when your friends and family come to visit.", "I hate when comments force me to use a dictionary. =(", "Oh god I'm so confused right now.", "No, fuck *you*, me-of-six-minutes-ago. Why the fuck did you eat the last cookie? I wanted that.", "It pisses me off more because animals are defenseless. Its like you're too much of a fucking wimp to abuse humans because they can fight back. Its not only fucked up but its also cowardly. Very cowardly.", "Oh, my God. Will all past instances of me please kindly shut the fuck up and let me read Reddit in peace?", "was it inguinal? newlinechar  newlinechar lol, bio joke.", "Why hello.", "They did an autopsy on the HD camera and found it was intelligent robotic alien life. But ssh, I didn't tell you that.", "Clearly we all need to start wearing fedoras.  Then the hipsters will become agitated that we 'copied their thing' and complain how it's no longer cool and that we're all poseurs.  They will soon move onto something else, like coonskin hats.", "Hrmmmm....... *looking at his HD camera with deep suspicion*", "OH.MY.FUCKING.GOD.", "It sounds like he's already in the friend zone. Everything about what the OP has said screams 'not interested.'", "What if the animal is a bear?", "Excessive, but still on target.", "I think you are over reacting ", "Well then it'd be Young Spice, and that's dangerously close to Baby Spice which is typically considered a no-fly zone for manly smells.", "The normal part of me is glad that link didn't have a pic. newlinechar  newlinechar The internet part of me is let down. newlinechar  newlinechar Desensitization at its finest.", "Depends. Are you going around shooting at them with machine guns or are you challenging them to hand-to-hand combat? I actually would have no problem with a dude that tries to wrestle one. Weapons are cheating.", "Psychologist here. It means you are uncomfortable with your own masculinity. I said masculinity, not sexuality. This does not mean you're gay, it means deep down you think of yourself as a bit girly and may over compensate. newlinechar  newlinechar I'm kidding I'm not a psychologist at all.", "yes... yes!", "it's more real to most people on reddit. They really can't imagine the absolute horror and brutality of seeing someone burnt alive, but can imagine people cutting to kill themselves.", "&gt;[I'm afraid you don't understand. These people killed my dog.](http://www.imdb.com/title/tt0822854/quotes)", "**ggghhhhhiiiiaaaaaaa!!!!!!** newlinechar  newlinechar I will hunt you down, slit your throat, and wear your eye sockets like a sphincter ring!  newlinechar  newlinechar  newlinechar &gt;*blood pressure rising*", "... ass. Then a miracle occurred, and a hot smelly fart let loose, and the dribble that was to become you rolled down far enough to touch the flabby hole that was to be your entrance to the world just nine months later.", "colored cherry red.", "...bb?", "lets take it back like we took back porch monkey.", "What the fuck did you say fag?", "I can assure you my friend, the details on this are details you do not want to know.  Not for the gory aspect of it, but for the humanity of it all given the circumstances of how he detonated. ", "[It's not 'bikini body', I can tell you that.](http://www.urbandictionary.com/define.php?term=bb)", "With bendy straws.", "His friend, apparently.", "Yes but Dexter's Lab said it about 390 more times. And with that awesome accent.", "Well to be more precise its not Americans as a people, its mostly the US's foreign policy. Desmond Tutu talked about that with Jon Stewart a few years ago (which I can't find the video of). It was actually pretty interesting. newlinechar ", "I've always related it the same way.  I'd usually think about how much trouble I'm in since I couldn't move very fast, yet they never could land a punch on me either.  We'd both be stuck in a watery dance.", "Fighter of the Night man!", "Psychologist here.  Your portrayal of a psychologist indicates that you are uncomfortable with your own job choice.  It means that you may want to rethink your career choice. newlinechar I'm kidding.  I'm not a psychologist either.", "Could you restate that?", "*upvomit*", "Janitor here. I'm here to change your personal garbage bags with fresh trashcan liners. newlinechar As you were.  newlinechar  newlinechar Just kidding, I'm a psychologist. Or brilliant mathematician? Or Matt Damon? Fuck it, I need help!", "That just makes you smell like a serious fire hazard.", "i'm with you", "Yeah, sorry bout that.  It did say graphic, though.", "with the little red shovel and fake ice cube pusher downer thingy....fuck yea", "If a guy could wrestle a bear to death, I would give him cake for it. However, shooting them with machine guns is just weak.", "I'm sure the elephant was also thinking newlinechar 'aw shit, of course the most dextrous part of my body has to be my nose'", "that's awesome, I always thought it was just me who did this.", "quiet son, you're past curfew.", "WE NEED TO GO DEEPER", "I'm used to it.", "I think he means a toque, eh.", "I want some f*cking answers! what's going on!? I don't feel unique anymore.", "Just set it to auto, it'll be fine.", "That's what she said.", "No, just one that looked exactly like me. The resemblance was scary. ", "So you have not donated sperm - OK then.", "The performers or the tickets? [I almost called them artists.]", "[Not to a bank.](http://instantrimshot.com/)", "Or the baby will be retarded.", "Banks take sperm!  I've gotta try this.", "Agree, sound like you just won the lottery.", "and a fancy cane", "NOW YOU'VE REMINDED EVERYONE OF THE PENIS POPPING GUY.", "Or have super powers.", "HA! Well - either way, she didn't want to get up. ;)", "why is the fact that theyre black relevant to the story? it's kind of a universal teenage trait to be annoying on halloween and go get candy without costumes, so the fact that he felt the need to call them out as black is troubling.", "College dorm RA, Ob/Gyn, or head of quality control at the sack-o-condom factory. Take your pick.", "If it's not relevant, why do you care in the first place? He's using 'black' as an adjective, not a derogatory term, as you assume.", "I don't know if they decided to have kids as much as they decided to fuck.", "It^looks^LIKE^it's^running^AwAyYy", "It's some sort of cryptogram. If I take the letters highlighted and place them in the order they appear we get: newlinechar  newlinechar youareatroll newlinechar  newlinechar Clearly this code is beyond decipherable. What could those random letters mean?", "Because if it's irrelevant, him mentioning it is puzzling, unless he is making a point about black people. I don't buy that it's inclusion in the story was simply to be an extra descriptory adjective---that's incredibly naive.", "the only words i could come up with are   newlinechar \t newlinechar retrally newlinechar aleatory", "Upvote. You have the an f-ing point there.", "slow-nap", "The book had so little to do with the final movie. Apparently several other movies were made from the source in the 60s and 70s with better results.", "Child molestation is illegal (so is soliciting a minor for sex), not pedophillia.", "Same here. Also, Manhattans are made with rye whiskey (not bourbon) and Martinis are made with gin, vermouth and possibly bitters.  I only keep vodka around for making chick drinks.", "A Loyal Router?", "slow-fap", "Bah, I knew I was going to get out-snobbed here at some point.", "I'm for it.", "Thanks for the soul-crushing humiliation!", "Saber-toothless saber-toothed seal.", "That flows so much better than 'seal'", "Actually, the dental community no longer officially recognizes them as teeth.", "Oh, okay... newlinechar  newlinechar /mopes in the corner", "Both parts of this comment have been upvoted.", ": )", "You keep using that word... I do not think it means what you think it means.", "Or don't be a moronic leech on society by trying to wrongfully sue people.", "So not punching them, but still thinking their a prick is not considered passive agressive?  Where do you draw the line between passive agressive and just passive?  Serious quesiton.", "The best part was calling the Athenians boy lovers... The Spartans took boys and holed them together and had rules that the younger boys had to serve the older boys...", "Women in liberal areas are more promiscuous.", "Isn't he the BEST?!", "Hell, the VCR scared me.", "I guess I should get that checked out, huh?", "[Or normal?](http://saddlebacking.com/)", "The secret is to throw bags of coke at it until it paradoxically calms down. Might be tough for a 7-year-old.", "Candyman", "Candyman", "see guys, i told you, nothing was gonna hapaaargh!", "I tried that.  I was searching for the pigeon locations in the GTA IV: Lost and the Damned and ended up learning how to give my dog a haircut.", "[Freeeman](http://www.youtube.com/watch?v=slRsexrhbG8)", "Dude, I've met Tom Selleck. I wouldn't mock him - he's fucking HUGE. Large. He's 6'4' tall and I think his shoulders are about that wide.  newlinechar  newlinechar Big. Really big. ", "I can vouch for the coyote-like nature of insurance company attorneys. Wait, coyotes are scavengers, right? Okay - they're more like a combination of black bear and coyote. With a horn coming out of their forehead. And they swim.  newlinechar  newlinechar OMG - they're *narwhals!*  newlinechar ", "['hapaaargh!'](http://omghorror.blogfaction.com/global/radar/blog_images/64553-1.jpg)", "That in addition to the mustache is *terrifying*.", "This is the point many people fail to grasp. Humanity is still concealed in a *bigger* sandbox when they get out of the Matrix.", "I'm not friending you. ", "You, Sir, are a bad, bad person.", "~ *Hug* ~", "Cheer up. You want a balloon?", "It's pretty clear those links are probably pornographic.  Fortunately, you were in a *fucking* library, so it must have been ok.", "One cockring to rule them all.", "narwhals aren't vicious and they don't have fur. newlinechar  newlinechar  newlinechar  newlinechar so, really, they're more like polarwhal bears.", "&gt;and all the children I've encountered ;) newlinechar  newlinechar  newlinechar  newlinechar  newlinechar Your nickname, makes that comment considerably more dodgy.  ", "FUCK YOU NARWHALS CAN BE WHATEVER THE FUCK THEY WANT, FUCK YA NARWHALS.", "This and nothing else will heal your pain.", "And I recognize you also, half my office.", "You're the only guy on reddit named after his own chin.", ":(", "Indeed, the depravity of that superfluous apostrophe is unspeakable.", "And entertaining to everyone else.", "I'm going to hire the A-Team to correct it.", "&gt;that movie ended lame newlinechar  newlinechar As did the book. Much as I like him, King's not very good at ending his stories.", "I don't know a single person who hates that movie.", "Or maybe hire zerokey as a spy for you to follow the people who are suing you.  I definitely suggest keeping zerokey on your good side.  He's kinda scary.  ", "I cried at the very beginning when all the other eggs and his mom were eaten :(", "And turn him into a real man.", "&gt;This isn't 4chan. newlinechar  newlinechar Could've fooled me.", "BAA DA BUMP BAH newlinechar BA DA DUM BUM BUH!", "http://www.bccla.org/05pubs.htm newlinechar  newlinechar ", "I did that once too. It is very unpleasant.", "Science Rules!", "and considerably more doggy. Style that is. Boom, see what I did there?! As in like because he/she loves anal, and that's done mostly from behind.", "I pity the fool who shaves his nuts.", "Really? I usually start by putting on my robe and wizard hat.", "Hell, the VHS scared me..", "&gt;As in like because he/she loves anal, and that's done mostly from behind. newlinechar  newlinechar Don't you mean: newlinechar  newlinechar 'Ass in like because he/she loves anal, and that's done mostly from behind.' newlinechar ", "If my son at the age of 15 had that much balls I'd be proud, too.", "*sigh* Sexlexia... newlinechar  newlinechar Oh wait, you said *Kif*.", "I would say your panties are on too tight if you take that seriously.", "Mine too. Then those digital pets, and then Pokemon (I'll admit I had a lot to do with this as I was making a fortune selling Pokemon cards). Then later those fuckers banned ultimate frisbee in gym class because we were having fun.", "&gt;Then later those fuckers banned ultimate frisbee in gym class because we were having fun. newlinechar  newlinechar Those bastards. newlinechar  newlinechar ", "Also, they told us congress passed an anti-dodgeball law and wouldn't allow us to play any more. (That was in grade school.)", "They put the kibosh on dodgeball in junior high after a kid broke is finger and made crybabby.  Too bad he didn't snap his god-damned leg running laps.", "Dude now I want weed and cookies, thanks a lot asshole.", "Could you check again because I'm pretty sure you're Phil. ", "how is crybabby formed?", "How do you know I'm not? newlinechar  newlinechar BTW your shoe is untied.", "Ok, guess you're not him, I'm wearing rain boots :-)", "ooOoh, and what else?", "[Know Nothing movement](http://en.wikipedia.org/wiki/Know_Nothing)", "skeeted on.", "Robe and wizard hat?!", "...was stupid.", "What the hell,  I like the idea and I've never made a subreddit before. What should we call it? newlinechar  newlinechar Ideas: newlinechar  newlinechar - TradeIt newlinechar  newlinechar - Barter", "Oh yeah, that's cool. But, how's your day goin', man?", "It's going reasonably well. Things are pretty OK here. How 'bout you?", "I think tradeit. Barter seems more like you're being greedy.", "Oh ya know... A little of this a little of that... Should be nice weather this weekend, eh?", "Yeah, most likely.  We'll see though, you know those weathermen!  How's your lawn doing?", "Oh, it is.  That's  it.   Really.", "And to further clarify.  When ultimatt42 says isopropyl is 'toxic' he means that it is 'really really really fucking toxic - as in, deadly.'", "...", "[Ask, and ye shall receive](http://www.reddit.com/r/Tradeit/) newlinechar  newlinechar Um...now what?", "No problem.  It's a very common disorder and a lot of people do not realize they might have it until they look at the symptoms.", "Me too, when I am not already asleep. ", "I even like being woken up... 3am surprise... newlinechar  newlinechar Hey, I never said I was normal.", "Haha no I think it would be fun, I guess I'll start on a logo, is there anything I should know before starting?", "Oh it's going great, I have the Smith kid mowing it every other Thursday with that new John Deere of his, how is the family?", "Oooh Durango you're right. I'm horrible with vehicle names.  ", "Computes perfectly . As long as they're not being assholes to *you*, assholes are frequently great fun to be around.", "Your account better be older than a day. I'm checking... newlinechar  newlinechar Four hours.", "Kind of like a bitch... So, long as she fucks me, I don't care how she acts towards others.", "Term of pregnancy is 10 months. newlinechar  newlinechar I'd look at your Dads friends Bdays. (just kidding, I'm trying to fit in with the thread)", "no no... she can live with what just happened. Just like [this.](http://www.youtube.com/watch?v=Sji46_rg4ec    'Wait for it')", "*I* sure as hell didn't. Everyone else thought we did though, the joke got old after a while...I hate you.", "You did, and it wasn't a joke.", "http://www.reddit.com/r/WTF/comments/89kto/student_finds_cellphone_turns_it_into_police/c08ml3e", "Same as the human body. ", "and my lotion!", "well it just got some more...", "I have no idea what this has to do with the above topic but that was hilarious!", "They just think they can coast through life.", "hah she has that one in a photo frame by her bed :)", "&lt;unnecessary pedant&gt; newlinechar  newlinechar Cute, but personal possession doesn't commute.  For instance, the doctor's lawyer might have a completely different doctor. newlinechar  newlinechar &lt;/unnecessary pedant&gt;", "Maybe he was talking about the cop in the OP's comment, because that was a devastating burn.", "Who isn't?", "Thank god, or I'd never have tapped that sweet, sweet Conorp tail. ", "Shut up, turkey!", "If you're going to make puns about something like this, they should really just disable the comment system.", "I think if we ramp up the puns that would make our discussions more accessible.", "Post pics.", "Weebles wobble?", "I say put the breaks on this before it runs off the path", "What the hell is a 'fag ball'? newlinechar  newlinechar Douchebags now have their own slang terms that're far douchier than normal slang?", "So...when did I let you tap that?", "and my anus!", "Term of pregnancy is 40 weeks.  newlinechar  newlinechar That is 280 days. An average month is just over 30 days long. ((28.25 + 4*30 + 7*31)/4)) newlinechar  newlinechar 280/30.4375 = 9.19917864. newlinechar  newlinechar The average term of pregnancy is barely over 9 months.", "Make baby again.", "that is weird", "I refuse to you play your Chinese food mind games. "], "redditoroftheday": ["Most men tend to self activate at the slightest stimulus so it's not a tall order.", "Amateurs, I swear to god."], "reddit.com": ["Seriously.  It might sound really stupid to say, but I'd be willing to at least give a game I'd never heard of a rental if I knew she voiced it.  She's one of the best English speaking voice actors I've heard in a game.", "some people never learn", "Frankly, kind sir, I don't give a dam.", "But not 100% of the time.  I am a witness.", "About being right 100% of the time.  Sorry, my attempts at adding humor into conversations don't work out well.", "Whenever I can.", "That episode was awesome by the way.", "You are an evil genius.", "I'm glad you have your wife. ", "You got your reddit family :)", "Show us your snake.", "I sure do. Thanks!", "Goodbye Bonneville!!!!!", "Nice reference, that is what i thought of too. newlinechar  newlinechar Its just been rainin', on my face.", "My eyes are just a little sweaty today.", "The mere fact that you call it 'pop pop' tells me you're not ready.", "I'll smoke to that.", "Yeah, that's a fun one. I love April Fools. This was a genius one for sure.", "almost downvote for grammar naziism. re read comment and lawl.", "...thanks Lawrence.", "Dear Reddit: Thanks for making me feel like the dumbest person on the planet   newlinechar    newlinechar   *Edit:* in my time zone it is 10:45 PM on March 31st... so... just saying", "AND YOU!! MUHAHHAHAH", "NINJABAN!", "I gave you infinite upvotes....", "I stopped at 9999. I didn't wanna seem karma whorish. ", "THERE CAN BE ONLY ONE CAPSLOCK ADMIN!!! WE MUST FIGHT! FOR THE PRIZE...", "I just banned myself!", "As a newly appointed admin, and his brother, I bestow upon you INFINITY downvotes.", "Well the upvote I just gave while not using admin was real. Happy April Fools!", "Don't worry, I banned you, too.", "Me! Ban me! Pleeeeeease!", "Never mind. I just banned myself!", "I upvoted both of you into infinity points.", "That is exactly what I changed it to, that *is* weird...", "to infinity, and BEYOND!!!", "Maybe I just want it to be real. This feels like my dad dressing up as Santa or something. It's real...but not really.", "And I am ninjabanning you as I type.", "HAHAHA DISREGARD THAT, I SUCK COCKS.", "Ditto.  Then I banned all three of you.", "Me too.", "I'll both.", "You're both banned for overuse of caps lock.", "I downvoted you into negative infinity and then ninja-banned you.", "ninja-banned for profane language", "Nice, I always wanted to live there.", "As did you, guy.", "It says you're 25% likely a spammer. newlinechar  newlinechar Would you like to explain yourself?", "Well, I went ahead and downvoted it to infinity. ", "actually it's like 5 clicks and it hits 'infinity'", "Um... um... newlinechar  newlinechar WOULD YOU LIKE TO ENLARGE YOUR REPRODUCTIVE ORGAN?", "As did you, friend.", "Ha! I just unbanned all of you and then banned myse", "Likely spammer, 5.54% chance, eh?  That's a bannin'.", "lol", "I was coveting my new found power and promising that I would use it wisely. newlinechar  newlinechar Then I saw this thread.", "CAN'T HEAR YOU OVER THE 95% BOT CERTAINTY", "A BOT YOU SAY?", "Ninjabanned.", "A BOT I SAY!", "NOBODY ASKED YOU  newlinechar  newlinechar *continues upvoting*", "Murdered.", "I have now banned the man who banned the man who banned Karmanaut. ", "Banned for no reason at all.", "Shilled.", "Banned for suggesting this is better.", "A SAY I BOT!", "My life is no longer worth living without fake admin rights.", "Damn I missed it. Upvote ∞", "I BOT A SAY!", "I have dipped my balls in the mouth of the man who banned the man who banned the man who banned Karmanaut. While you were asleep.", "Banned for being in a band and needing a band-aid", "SAY BOT I A!", "Banned for being karmanaut.", "You should ban him.", "If you need your values reaffirmed you can always try /r/atheism ", "AI!  AI!  FTAGN!", "banned", "Yes, I do realize this. But it amused me, and that's all that really matters. ", "Have an upvote for being second....and dead sexy.", "Banned for banning.", "Have another few upvotes.", "IP:47.168.137.213 newlinechar  newlinechar Expect a visit from the Mormons any day now, Mr. K1Y 4H7, Ottawa, CA", "ten clicks to *infinity*", "I'm not karmanaut. You're karmanaut. newlinechar  newlinechar BANNED!", "    ass-hattery", "So all the other IPs are fake, well that's a relief. newlinechar  newlinechar Upvoted to infinity for you. newlinechar  newlinechar But also you ruined the joke, Ninja-banned! ", "I'm on it! Banned.", "[Let's watch that karma flow right in!](http://www.reddit.com/r/atheism/comments/bl0bc/attention_rcirclejerks_new_home_reddit_is_being/)", "io cvjn tyope wityh muy tonbguew!!", "Don't mess with me, I'm an admin!!", "They thought of EVERYTHING. ", "I am karmanaut? No, I am Skeleton Jelly!", "The first thing I did was go to circle jerk. newlinechar  newlinechar IT'S GONE, WHY?!?!", "atchon (likely spammer; 92.11% certain) newlinechar  newlinechar Oh how the tables have turned!", "Ninjabanned!", "no.", "It actually was something like that.  Damn you for using your admin powers to mock me!", "It's pretty bantastic, if you ask me.", "Exclamation marks with just his tongue? He is even more powerful than we realized!", "Yes, that's a good summary for anyone who didn't have time to read the full post.", "Next to orangered | turn admin on", "Oh, if only the title changes were visible to other users. *Just for one day.*", "Find-Shills! newlinechar  newlinechar wait what?", "You are Skeleton Jelly? I've been looking for you! NOM NOM NOM BANNED", "&gt;Exclamation marks with just his tongue? newlinechar  newlinechar Maybe it is a tongue-and-nose movement?", "Want your 'upvote' to be even harder? Try this all-new, scientifically proven natural herbal supplement!", "They... .THEY'RE EVERYWHERE!", "! Haha I can't believe I just did that. Disregard my original comment. Excuse me while I go contract some sort of disease and die.", "Who are you, Bruce Banner??", "Oh man, that's awesome! UPBOAT!!", "Everyone bans karmanaut on their first trip back.", "I'll zaboomafoo.", "! ... I immediately regret that decision. BRB gotta go wash my tongue off.", "I know kung fu", "haha good one.  have 10 upvotes", "You can't see anyone's actual IP, besides your own.", "*Zing*", "karmachrist", "So... you are not in Africa?", "Oy!  General Faggotry is afoot!  ", "No, he's a probable bot; 24.57% certain.", "Banned for 99.88% chance of being a bot.", "They're eating her... and then they're going to eat me", "! my shift key is salty.  :(", "Nope. I also figured it'd probably be the animal, and it was just some Redditor trying to make a witty pun.", "ya u got us man", "I wouldn't. You smell bad.", "@ .... D'oh! D:", "Appropriate use of admin privileges. Banned.", "You're a probable bot, 83.82% certain. That's pretty damn certain.", "What I was trying to say is that I don't think random users can propagate changes; however, I do think the thread creator, Prysorra, can propagate the changes he or she makes which I don't believe is something you can normally do.", "Banned?", "I'm not a bot, dammit! I've got a heart, and a soul, and a spleen. And several other organs, I'm sure.", "No she is now diamonds. ", "you now have ∞ points", "Banned you for 54.04% chance of being a shill account newlinechar  newlinechar EDIT: Then administered a lethal dose of upvotes.", "What I find entertaining is that they redirect Candle Ja to Candlejack. I thought Wikipedia didn't have a sense of h", "I just made the edi-", "Oh what does mine say?", "It really just feels wrong to downvote/upvote anything just once now. ", "Well he shouldn't have been pretending to be a zombie.  Nothing good can come of that.", "Good teamwork!", "God bans you.", "I don't blame him.", "And beyond!", "(likely spammer; 32.80% certain)", "How'd you get on Mars?", "Death by upvotes? Oh...my..**it's a massacre.**", "Helium, baby. A shit load of Helium.", "Its ugly what?", "I hear you.", "likely spammer; 33.05% certain newlinechar  newlinechar I knew it, Triple-M.", "Yo Dawg, I heard you like banning yourself, so I banned your banned account..", "Prozac does a lot of things.", "My favorite episode is ['If I Can't Smoke &amp; Swear I'm Fucked'](http://www.youtube.com/watch?v=diHfDP-MhXA).  I show this episode to anyone that I think might have an interest in the series.", "And less healthy than taking a deep breath and counting to 10.", "Every frame of the gif photoshopped a boner into my pants.", "LEARN WORK INTERNET", "Serenity now!", "Nah, this is unfortunately not such a rare occurrence, which is why this unfortunate law was passed. ", "With my jamboni.", "It used the 'pencil' tool.", "Holy shit im crying.", "Cro-Magnon*", "Do ya feel evolved punk? ", "Don't be Reddiggulous.", "I used content aware.", "Welcome to the brotherhood of the non-teeth smilers!", "Prozac is a hell of a drug.", "Well, do ya?", "nonnuendo?", ":)", "If they hadn't outlawed the chain, I wouldn't have to USE THE PIT.  Their own fault really.  It's mine.", "nice, third time graduate here :)  still in Houghton.", "You know much for a bagel.", "9089, lol", "bless you child", "Yes, dogs often eat their placenta. newlinechar  newlinechar My dog also often eats her own vomit after she pukes. newlinechar  newlinechar Should we start doing that too? Are there 'special nutrients' in vomit that we are missing?", "A quack.", "Let us pray for him.", "Does he also have a  Jump To Conclusions mat?", "It's very cold here.", "hot sister.", "Or as Ratso Rizzo said in Midnight Cowboy: 'Hey! Hey! I'm walking here! I'm walking here!'", "That would be Billy Johnson of Warwick Rhode Island.  newlinechar  newlinechar He was the lone person in the world who was expecting T-Pain to have a legitimate singing voice. newlinechar  newlinechar Congratulations Billy.", "yeah he is. i had no idea he was [such ](http://www.indecisionforever.com/2010/07/23/quote-unquote-ben-stein-defends-his-impeccable-honor/) [a ](http://blogs.orlandosentinel.com/entertainment_movies_blog/2008/02/is-ben-stein-th.html) [cunt.](http://rawstory.com/blog/2009/09/ben-stein-says-dems-are-mostly-gay-and-lesbian-insists-gays-attracted-to-young-boys/) newlinechar  newlinechar however, he did say [this](http://www.cbsnews.com/stories/2010/04/11/sunday/main6385229.shtml?tag=pop) and [this,](http://blogs.abcnews.com/politicalradar/2008/09/will-palin-win.html) so it's kind of a double-edged sword: one side is full of cunt-itude; the other side is pretty much full of awesome.", "They funded it, though.", "Or as Karl Childers says in *Sling Blade*: 'I'll have some of those French Fried Potaters. Uhh huhh.'", "'s boyfriend.", "I'm pretty sure the DEA is all for it. Drug Enjoyment Agency, right?", "where x∈ {bodies out there}", "And invented glitter...", "*insertia herion!*", "Indeed. I love smithwick's.", "Emma Watson is real, though.", "done. thanks.", "'Think locally, fuck globally.' newlinechar  newlinechar Thus is my political mantra.", "Ya, don't be a tool. Strand her ass in LA and head for Las Vegas.", "Hopefully you have better luck than I did 6 hours ago.", "Is it expensive to live in NY? I've been wanting to move there for ages.", "Or, we just all pick a spot, and totally take over some random, unsuspecting town for a day....  Kinda like a zombie apocalypse, but with redditors (which may actually be worse with all the social awkwardness)", "I'm by no means rich, but I get by. Move here; you'll love it.", "Can I has both?", "Boo Radley?", "..for us. newlinechar  newlinechar Pax Americana anyone?  The citizens are safe and cozy inside but at the borders, or across the seas, the empire is maintained by force", "I just live in a dying suburb. They shut down the 3-5 elementary, and the k-2 is shutting down next summer. No more kids.", "But the GSR was on Katrina's sleeves. The verdict is in, (puts on sunglasses) but the jury's out.", "10/10", "oh shit, i'll just say it. newlinechar  newlinechar ahm chargin', mah laaazer!", "I'd probably do the same, hold out for a while, then depending how things went, ask X to 'pimp my tip'", "Rap, apparently.", "quickly, everyone, to madagascar! lest they close the ports before we arrive.", "Her face got in the way of his fist as he was trying to punch the floor.", "Good ... Day!", "Or Tankless water heaters =)", "For his rap he is worthy of fame. Also the first 5 min of pimp my ride are excellent.", "Awww, too late, someone sneezed and now they closed the ports, airfields and roads...", "I think he intentionally the whole sentence", "We're safe as long as they don't learn plumbing. newlinechar  newlinechar I urge all redditors to not leave plumbing howto books open... it's ok to own them, can't can't flip the pages.", "apologize *harder*, god dammit.", "It's pronounced 'book-an'. newlinechar  newlinechar But alas, I did post a cute animal video. So perhaps I should start pronouncing it 'bu-chan'. newlinechar  newlinechar  ", "Sanity demands it.", "SHUT. DOWN. EVERYTHING.", "&gt;People shouldn't hit people, unless it's in self defense. newlinechar  newlinechar ...or S&amp;M", "Never underestimate a simian, even one with stomach problems. newlinechar  newlinechar Although, granted, it may affect their ability to fling their feces at you (which might be a good thing - at least for you).", "I have a car and a job.  But what I yearn for is a biscuit.", "Maybe I've just witnessed domestic violence in my life and have lost the ability to withhold judgment.  ", "family love... I see  :)", "Okay, well, I'm clearly out of my depth here so I will take this opportunity to respectfully butt out.", "I know you love me. You don't have to show it by senselessly hurting my because though. ", "Do you dye your skin orange as well? How does this work?", "You use what you got.", "There is nothing intrinsically bad about being  a lawyer or politician. newlinechar ", "It's inaccurate though. Technically speaking, it's not domestic because Rihanna is from Barbados.", "I have to admit I 'ooooo'-ed at the picture of the mansion. ", "...or SM(Seizure Man)", "Based on my experience with the kind of christofascists we're discussing, I think the very thought of it would give them the vapors.", "Ahh Ahh Ahh...it is now Xe, not blackwater...that changes everything!", "Yes. Now we in our family call him 'ze child toucher'", "Believe what allows you to fap at night.", "Cripples do that just fine!"], "MensRights": ["I blame Carrie Underwood.", "Get a police report of that and save it. It will help in the divorce.", "Put cameras in your home.", "Well in that case you're suggesting to do exactly what both sides are fighting against. When you transcend self defense, you become the abuser.", "Are you implying that women would like to continue enjoying the fruits of the patriarchy when it comes to having White Knights protect them? newlinechar  newlinechar Oh, I do declare!  You're giving me the vapors! newlinechar  newlinechar /s", "Day took er jerbs!", "Morally I agree with you, they do not.  But legally they do. newlinechar  newlinechar http://writ.news.findlaw.com/colb/20050309.html", "thanks for the head's up. I'll go check that out over there too.", "**Clarification:** That's why I'm not too surprised by this thread, not why I'm starting threads like this. (I try not to.)"], "shittyadvice": ["Nice try saydrah. ", "No, she will get pregnant, but in the wrong place!", "Screw you man that stuff is delicious and I would eat it year-round if I could find it year-round.", "I can and I do.", "Well to be fair, it was some pretty shitty advice, given the expectations in /r/shittyadvice.", "Should I offer extra incentives for my relatives? Like, 'Free three inches for my relatives' or perhaps something similar?", "How much am I required to spend on a a Halloween costume to please you?", "I'm afraid I don't know how to do this. Could you please PUNt me in the right direction?", "An entire watermelon each, through your windshield. "], "worldnews": ["You broke my sarcasm-o-meter!", "Dude, seriously. ", "And we all know that ALL generalisations are wrong!", "Texas executes mentally disturbed juveniles.  Just what definition do you need for 'witch'?", "Strong opponent of death penalty as well: newlinechar  newlinechar There is still a significant difference between executing a mentally disturbed juvenile for murder and executing someone for fortune telling.", "Frankly, I think removing all military/police-related aid and boycotting their products would be a useful policy for the US to take toward both Texas and Saudi Arabia.", "I think it's more than marginally. newlinechar  newlinechar Don't forget that Abbott is the one that blocked RU486 when he was health minister and said that stem cell research would lead to human-animal hybrids.", "I'm *so* glad those weren't pictures of penises. As implied by your username.", "Ok, fine. You're not pedophiles. You're just rapists of underage boys.  newlinechar  newlinechar So, arrestings now?", "Hey, now we need a bigger military to protect us from the threat of a nuclear armed Pakistan.  Awesome.", "I know, right?", "No oil? Have fun with that.", "I have once of good english. But not today.", "Oh how I wish I had an army of puppets to give you upvotes.", "I believe that ya'll're is prefered.", "Totally.", "'And I curse all of your sons with an insatiable thirst for cock!'", "Only if he weighs the same as a duck.", "Wait, are you being sarcastic or not? newlinechar  newlinechar I'm so confused and aroused...", "&gt; Religion is based on the Bible. newlinechar  newlinechar So, not really up the details of Islam? newlinechar ", "me too! but I got better", "Don't try to poke holes in my irrefutable proof.", "Was it rape or molestation or statutory rape? I couldn't really find clarification on that. Because people here cheer on women who fuck a 13 year old and cheer the guy for 'getting lucky.'", "confoused.", "Like omg.", "However you phrase it, they are still a bunch of perverted kiddie fiddlers who should go to jail. Anyone who helped to cover it up should also go to jail for perverting the course of justice. newlinechar  newlinechar Whatever, they're all still a bunch of pervs", "&gt;However you phrase it, they are still a bunch of perverted kiddie fiddlers who should go to jail. newlinechar  newlinechar Yes, but how you phrase it determines the length of the jail sentence.", "Was it non-sexual and silly?", "Hmm, Paranoia Agent, FLCL, Neon Genesis Evangelion, Serial Experiments Lain and Elfen Lied... newlinechar  newlinechar There were no survivors.", "Agreed. Interesting tactic", "I see what you're gettin' at...asian_fetish.", " This guy killed 8 kids. That alone prompts me to conclude that I don't really give a fuck about his mental stability or lack of thereof and I suppose neither did the Chinese. ", "Thanks! newlinechar  newlinechar By the way, does anybody know about the story of the roman 'squad' (I don't know if it's the right word, sorry) that was sent to China and never came back. I think they found genetic traces in chinese people", "&gt; Ethnic Russian newlinechar  newlinechar ಠ_ಠ newlinechar  newlinechar &gt; Ethnic Han newlinechar  newlinechar ^_^", "i'm chinese, japanese, dutch and icelandic. my family history is embroiled in rape. ", "&gt;No America involved, not news.  newlinechar  newlinechar FTFY", "so who are you gonna rape next?", "probably some greek, or middle eastern....damn those guys are sexy. could use some of their swarthy skin and sharp pointy features.  newlinechar  newlinechar yes my family is the zerg. ", "Or it could be that it wasn't a defense mechanism at all, and Misanthropologist simply didn't personalize or catastrophize in the way that alle0441 seemed to.", "AAAAAAAAA SIBENYAAAA", "Thanks.    newlinechar  newlinechar *the more you know*", "No videogames and paxil involved, nor were the perpetrators punk teenagers, who are the primary objects of our senescent ephebophobia.  Not news.", "It's also worth mentioning that the more natural human languages we have to study, the better will be our understanding of how humans do language *in general*.", "I never said all trrrsm is bad. Mandela is another man's freedom fighter.", "&gt;Your friends throw a party to show you're a pretty cool neighbor. newlinechar  newlinechar FTFY", "I'm assuming it's acting like a 'open this if anything mysterious happens to me' note that you usually leave with your lawyer, except the note can never be confiscated because it's now being copied thousands of times all over the world.", "yeah, it does not fit their un-nuanced narrative. ", "When it gets decrypted they will go after wikileaks for copyright violation.", "lol like whoever downvoted me really knew what the point of this all was. newlinechar  newlinechar Thanks for explaining, I'm not too proud to ask for clarification when I don't get the story. ", "Yo dawg, I heard you like insurance.", "Wow, that was not the impression that I got from the original report. I guess there weren't many details at that point.", "Yeah... openly religious... then some people might think about weird cults.. but confessing to your co-worker that you believed in god after a few beers? Not really that 'cultist'", "yup. hells angels vs. arab gangs. It's getting quite bad here in Copenhagen.", "Well played. ", "'Ah, thanks for that! Was it good for you? You have a huge cock. What's your name?'", "How about them Canadians? I would say the mix is roughly the same (though the numbers (population) may be different) ((brackets)). ", "Canada is closer, but, still, over 80% of Canada is Caucasian. newlinechar  newlinechar In the United States, 68% of the country is Caucasian. US ethnic diversity is another beast.", "USA! USA! Wait, what?", "so they're just in it for the money? newlinechar  newlinechar (ho hum, off to PC re-education camp again)", "Haha! Dumb American!", "Ah, yes, the violence in the streets, the breakdown of civil service, the armed insurrection, the high murder rate... No. Belgium might be unable to choose a government properly right now, but they're still rather civil about it. And that IS the difference.", "That makes it a lot easier to live with your hypocrite self.", "My sister was bitten by a Christian once ...", "It's always a cult until enough people follow it. Then it becomes religion.", "No, you've got Jesus;   newlinechar    newlinechar A not too distant relative of Issues", "Almost everyone born in Norway was baptized. Asking 'Are you Christian?' in the English sense of the word has little meaning. Instead, when we say 'kristen' we mean someone with a marked belief in God. People who attend church and pray.", "You could put the conclusions on a mat and call it a 'jump to conclusions mat' newlinechar  newlinechar Someone should patent that.", "I should have expected this comment, but it caught me completely off guard and caused much laughter. Thank you.", "And then start reading about the [Holocene extinction event](http://en.wikipedia.org/wiki/Holocene_extinction_event) to see that ass raping the planet has effects.", "Me too. For a brief moment I was *extremely* interested in this film. now, not so much.", "As a Dane, I confess to the exact same thing.", "as I'm sitting here, nursing a serious hangover from a fastelavnsfest yesterday, I did the same.", "Wow, thanks for the link. I never realised just how many species we have driven to extinction. Quite humbling.", "Is she a Christian now?  I hear that's how it works.", "'Motor manslaughter' sounds too cool to refer just to some idiot running over someone with their car.", "I'm willing to bet that there've been quite a few millionaires dying contentedly on their eighty-ninth birthday after a fruitful and emotionally rewarding life, or cancer sufferers slipping gratefully away after months of agony. newlinechar  newlinechar Pedantry aside, it is a strange turn of phrase.", "'Democracy is the worst form of government -- except for all the others.'", "That would be dishonest. The US government would never be dishonest.", "My only regret is that it is tied to what appears to be a very unpopular comment. C'est la vie. newlinechar  newlinechar I'm actually a little confused about the hate being spewed on *zigzag_watch*, though. It's not like he's wrong.", "I don't care what Israel does either,  But i think the main problem most redditors have is that we give Israel a LOT of money to do whatever it wants with, and that is normally against your average redditors moral compass.", "The Reddits be a fickle mistress."], "Drugs": ["good for you.  that's some dangerous awesome shit.  it is an incredible feeling, but life is better.", "This is true.  Usually, I just call it weed.", "I don't know why, but I find it kind of disrespectful to call it weed. To me, it's much more than a weed.", "I hate to be that guy (lies, I love it), but it's not proven and probably isn't true.", "'Killer nugs' dude.", "Straight to the point, this guy!"], "programming": ["You beat me to it -- time to upgrade.", "Fuck. I laughed pretty hard at that... that's a bad fucking sign.", "Which is why there is now vim. (vi improved).  No joke: read the author's thoughts on effective text editing:  newlinechar  newlinechar http://www.moolenaar.net/habits.html", "Pick a side or burn, motherfucker! vi for life! newlinechar  newlinechar /kidding", "Stop being reductionist.", "vim, sure. vi, good luck moving the cursor with those. ;)", "Pssst, under the post box for replies there is a formatting help link.  It tells you how to properly quote.  Here I'll make easier for you: newlinechar  newlinechar \\&gt; instead of | newlinechar ", "I don't know if you were only lamenting the past but modern Windows has [Powershell](http://en.wikipedia.org/wiki/Windows_PowerShell) which is indeed powerful. newlinechar ", "It corrects what the parent didn't say, but what I read: 'They stopped shipping Notepad'", "hatter means that Notepad (permissibly, but pointlessly - and problematically for these other applications) writes a BOM; that Notepad does not '(correctly)' write this, which suggests that to not write it would be incorrect.", "The **@AnimalsHarmedDuringTheMaking** annotation allows you to disclose the mistreatment that befell any animals during the implementation of you code. newlinechar  newlinechar YES!", "US", "I guess it's newlinechar  newlinechar &gt;red is a *restricted* ed: it can only edit files in the current directory and cannot execute shell commands.", "It's true, that's *exactly* what would happen.  My uncles and grandpa always tell me that 'snopes' is a crazy liberal trying to convince people that any liberal critique is false.  sigh.", "Because when programming you spend perhaps &lt;5% of your time typing source code.", "Even *more*. [Line Islands](http://en.wikipedia.org/wiki/Line_Islands) are GMT+14 :)", "Also note the acronym for the Google Annotation Gallery: http: //code.google.com/p/**gag**/", "Which is why it's good to provide links to the Snopes sources, not the article itself. newlinechar  newlinechar (just like Wikipedia)", "Shhhh, you'll upset them.", "Right, because the type of people who believe the *Obama is a Muslim Nazi socialist* chain emails is exactly the kind of people who would carefully check sources, and change their believes based on researched facts.", "A web-based content management system like Sharepoint but entirely in x86 assembly.", "The whole #! mechanism is handled by the kernel. It is the kernel team that refuses to modify the kernel to handle the BOM.", "...it even stays that way when you put in Digg or Slashdot as the referrer. newlinechar ", "Drunk sex sucks. Its been scientifically proven. ", "I must be the exception to the rule. Turns me into superman.", "Me as well. I suspect the fact that I can't feel my penis has something to do with it. ", "&gt; Thank FSM for git reset newlinechar  newlinechar FTFY.", "Wat?", "Older versions don't do it. If you think about it, it is really fucking stupid. What if I want to make satirical art that uses facsimiles of bills? newlinechar  newlinechar Edit: Older as in 7, and earlier.", "Gimp. Yeah, I know, it's no Photoshop...", "It is. He claimed it would be called iTeX. :-)", "Yeah... as in not linux or mac (or true dos for that matter) newlinechar  newlinechar  newlinechar  newlinechar **Actually**, it works in linux too with mono. Thanks to those who corrected me. (You can tell I'm not a linux guy)", "Holy shit, someone tell Malcontent :)", "Why? I'm new to this meme.", "Malcontent doesn't believe you can write an application on windows, and then just fire it up on mono. newlinechar  newlinechar Despite the fact that I wrote [this](http://www.gfilter.net/code/mario.png), and then played it on a friends Ubuntu machine with no issues. newlinechar  newlinechar ", "Just throw it on GitHub, none really cares about code quality. Honestly. A useful tool is just useful.", "Do it in Visual Basic so you can trace IPs too.", "How about I'll make it in silverlight, so you can view it in the browser. That'll be neat", "Latest firefox and it lags horribly.", "It's pretty clear that this is a major motivation here. He probably figured that such a public failure would limit his growth at Google. I don't know if it would or not, but it's not unreasonable to think so and jump ship.", "I...I...was just trying to prove a point.... newlinechar  newlinechar *Goes away and sulks in a corner*", "i meant birthday.  my bad.", "yes, it can't do nothing. :)", "that was back in the boring days. newlinechar  newlinechar okay, I'll explain the real lack of radio porn: the FCC.", "I did...the page didn't load...*snarksnarksnarksnarksnarksnarksnark snarksnarksnarksnarksnarksnarksnarksnarksnark snarksnarksnarksnarksnarksnarksnarksnarksnark snarksnarksnarksnarksnarksnarksnarksnarksnark snarksnark*", "You rang?", "Well hello.   I couldn't come up with anything snarky to say,  might you take over?", "Well I *am* a turtle so I might be a little slow   newlinechar  newlinechar Also I want lettuce", "Wow, I hadn't heard about that -- my bad. I salute djb for finally getting over himself.", "Orbiting the sun. newlinechar ", "You can't prove that.", "And in 20 years it'll be just as lame as a rotating duck today.", "You can't disprove it.", "Yes, 3.1 will come with TraceMonkey, which is in line with Chrome and the latest Safari JS engines.", "Yes, but it was all two years ago ;)", "The dragon in my garage can.", "I just get annoyed when people think sexuality is simple enough to reduce to a mere gender dimorphism (that is, they think what turns you on is determined by gender). It reduces a good part of the human comedy to a mere stand-up routine.", "What dragon? All I see are tin cans, a ladder and an old tricycle.", "Fair enough.", "Oh I wondered why everyone was complaining it was slow.", "Upvoted, exactly what I was going to say. You could have declared a char* instead and assigned it to a function that did the exact same amount of work.", "In all honesty, the FQA has some good points but also some bad ones. Better to judge for oneself, and only after a lot of experience (C++ is very newbie unfriendly, but that doesn't mean it isn't great once you're over the hump).", "I knew it wouldn't take long for someone to get it.  Now, how quickly can you factor n?", "Why factor n when I can just add n to one of your existing keys?", "Hahah, oops!  Now *that's* embarassing. newlinechar  newlinechar Edited the source file.  That's not fair.", "Bravo.  What did you use to factor it?", "ifactor in maple; newlinechar factorization took around 0.3s", "Sure enough, I should have just tried that.  Doh.  So this whole idea sucks.", "Agreed 100%, why is this downvoted? newlinechar  newlinechar http://www.crackmes.de/", "Well, it is a hacker challenge.", "'Scrapped for parts,' you mean?", "i'm pretty sure most good programmers just get very annoyed by talentless pr/marketing types trying to ride their proverbial coattails.", "I'm pretty sure most good PR/marketing types get very annoyed by talentless programmers trying to ride their proverbial coattails too.  But I don't think that's what charltonj was asking.", "Buy you a drink if you think you can prove it.", "I've seen &amp;lt;escaped&amp;gt; XML in XML.", "Or flash, which is at least as bad (but on the upside, so can do progress bars)."], "nsfw": ["I volunteer.  I'll take one for the team.", "&gt;I volunteer. I'll take one *from* the team. newlinechar  newlinechar FTFY", "Greek?  No.  Broke?  Yes.  An upvote for your enlightened perspective.", "Do it to me every time", "Oh, the red-head said you shred the cello.. newlinechar ", "And I'm jello-o, baby...", "What he's saying is he doesn't like sharp knees.", "Yeah but if no one is holding the camera, won't it just fall through to the core of the earth?", "They all look alike to you, don't they."], "videos": ["'Tylenol, flu, and gay' (_Acetaminophen 325mg, Detromethorphan 10mg, Pseudoephedrine 120mg, Heteropam 108mg_)", "That's not always the best idea.  Depends on the why of the cry.", "Personally I think it's just; 'Oh, the fucking crying. Again.'", "Time to [pull an oldie out](http://www.youtube.com/watch?v=a1Y73sPHKxw) of storage.", "I believe he was talking about the homosexual culture, ie gay child liking all the single ladies (as in Glee), and traditional western dad not being cool with it.", "Did you see how upset she got when her parents wouldn't acknowledge her gender identity just because she was born biologically male?", "Nah, they'll have their own pop culture by then, they won't need ours.", "Gender recruitment is where others (especially parents and peers) influence a child's gender either passively or aggressively according to traditional gender/sex links. newlinechar  newlinechar And I gotta say, the concept irritates the living fuck out of me, but what do I know; I'm just a neolithic, traditionalist, chauvinist prude.", "By golly. I've just been slightly enlightened.", "Eat my shorts, ass-Krusty", "'Cover your ass well enough and enlightenment will follow.' -The Dalai Lama, regarding the dranjug lama skirt.", "Abe Lincoln did not have an incomplete beard. I demand you take that back, or give me $5. Your choice.", "We have to assume that straight me isn't interested in becoming gay me.  But the logic of your comment isn't lost on me.  If I was indeed gay, I would be all about the dick.  Dick, dick, dick. newlinechar  newlinechar Damn you Carl's Jr.!!", "Why must I cry, why must I cry, why?", "Actually in Thailand he'd be a kathoey, which is concidered more of a third gender.", "I bet I know where you store that...", "But then you realize he's videotaping while driving.. back being a horrible father again.", "Really?  I know a number of native American cultures have the Two-Spirited/Berdache.  I wonder how many other cultures have something like this, since it is so alien to the 'tradition European' culture. ", "contrary to popular belief most children are actually cute, and the vast majority of adults who find them cute are not pedophiles.", "Very interesting, never heard about that before, now I have something to do instead of applying for job, sweet.", "Nice vag.", "To infinity!", "roll, she's going to roll out of that van and FUCK...YOU...UP!!!", "hahaha it's like an M Knight Shyamalan movie... but with more wheezing.", "Girl-moobs. The circle is complete.", "And Ju-jitsu! newlinechar  newlinechar Well... standing with a metal pole, then standing slightly lower with a metal pole.", "i couldn't believe she is straight. ", "You'd really need alot of excess testosterone to get it up for her. In other words, her boyfriend is extremely manly.", "Be careful what you say, she might lightly scrape a metal bar against a concrete post again.", "no kidding.  newlinechar saving money living w/o my cable bill was never so easy. newlinechar  newlinechar funny how this happens the same week that Hulu starts CHARGING MONEY.", "Is it true?", "And his denial might be tainted.", "Where's the ConformationDude when you need 'm?", "I feel really sad watching this as well.", "&gt; you are not Glenn Beck while being Glenn Beck newlinechar  newlinechar WAR IS PEACE newlinechar  newlinechar FREEDOM IS SLAVERY newlinechar  newlinechar BEING GLENN BECK IS NOT BEING GLENN BECK", "'Bloody hell, you'd think you were in Delhi'", "A ladder made entirely of carbon fiber would be a bit expensive, wouldn't it? ", "Cracker wants a cracker", "where's 'yahoo browser'?", "Seriously. I've been trying but I keep falling off the perch.  ", "http://help.yahoo.com/ie/bt/tutorials/cl3/c3_basics1.html newlinechar  newlinechar Been around for ages really (in the UK, where our main telephone provider BT and Yahoo have a business partnership) - just a crappy skin for IE.", "thats the one.", "You have to click the link instead of watching the video in Reddit... kind of wierd", "Q:  What the fuck was that?     newlinechar A:  Awesome"], "trees": ["the current problems with LED's are scalability, costs, and quality of finished product.  they are good for veg, supplemental lighting and micro - small grows.", "I live in Toronto, and only the emptiest concerts are weed-smokeless.", "haha yeah i was gonna say about 7 days", "isn't that the point?", "I mean even when I'm sober. I guess people here forget what it's like to smoke on occasion, but if I smoke up in the morning, I won't be back to a [0] until the next day. Not quite [1], but you can feel it.", "I couldn't have quit cigs if I had been smoking weed at the time. The three best cigarettes are, in no particular order: newlinechar  newlinechar After a meal newlinechar  newlinechar After an orgasm newlinechar  newlinechar After smoking pot", "Wow! i smoke 8-10 bowls and don't reach [8] sometimes. You're are lucky because you don't have to buy as often as me.", "You left them in my car. I found six of them when I cleaned it out one time. All different colors.", "Orly? Awesome!", "I didn't enjoy it because I'm a smoker. I found the KFC/Drug references the funniest thing. Actually i thought the MMJ story was the weaker story of the two. ", "Happy banana and green spiky leaves for you kind sir or m'am.", "I miss the old header, the calm green cursive trees was soothing, it looks like a 4 year old made it now. I'm holding my tongue til tomorrow in case this is a lame April Fools joke.", "Ahh good point. But I strongly agree with the nice soothing trees.", "Do I need to fill out a form for my high five to be official?", "I must have the dirtiest mind to think what I did when I read that.", "And for you sir, infinite upvotes as well!  Happy April Fools...or I'm just [9] :D.", "A boat with hemp canvas sails.", "I smoke every day, but I know exactly what you mean. I call it brain fog, it's like a leftover residue in your mind.", "and quesadillas", "just... just don't bring it up. We're all in a better place now. ", "mmm quesadillas :) can we bring some ice cream too?", "Don't forget about the fruit rollups. Never forget those.", "Don't forget to bring a towel!", "I love you too.", "dendrophilia", "I smoke dank, therefore I am.", "Legalize it!", "my admin powers say both of you are probably bots.  I refuse to believe in bots on /r/trees.", "Is there an upboat script to make this easier?  Oh and YAY!", "Nah, it looked legit.", "Where's the love then, homie?  I don't say fuck your school.  To the contrary, I got a good friend there and have heard only wonderful things about your place of higher learning.  Us potheads gots to stick together for the development of our multicultural community", "Ya wanna get high?", "THC potent oil dipped buds high? sure!", "LEGALIZE BANANAS!", "Says mdewitt42 (suspected shill account; 87.61% certain).", "I am the queen of france!", "A BILLION UPVOTES!", "April Fools Motha Fuckaaa", "Hey! Yes you (hits bowl) can!", "hi i'm 17", "Lol, call me when you are 18,mk?", "I'm 19 ;)", "What if someone shows up with more weed to smoke?", "i guess your new god works in mysterious ways.", "Samesies.", "lol.  Things can always be worse.", "Legit", "like a champ.", "Yes..."], "technology": ["Here, too. Can't these things wait until noon so we know people will get it?", "You will soon, must be googles April 1st joke... http://i.imgur.com/g4LIb.jpg", "I just put on my red/blue glasses. It works!", "HI BILLY MAYS HERE WITH MONSTER CABLE", "I don't have any, so I was wondering whether it did... Based on the red-blue offset versus the distance, it seemed to actually work. Cool.", "Application has been restarted, please try again.", "Here is a gif I made with google maps in 3D! http://i.imgur.com/0M07K.gif", "You really don't know about this?", "link to article? ", "Why is there a jury.  Why don't his parents just ground him and take away his computer for a week. newlinechar  newlinechar 20 something years in prison...a little harsh.", "http://en.wikipedia.org/wiki/Michael_Connell", "Subtle. I like it.", "Just make sure Internic is your first bounce, add 20 more hops and at then erase the logs at Internic.  Easy peasy.", "Time to go install that again, I love Steam.", "Holy fuck 0.o newlinechar  newlinechar How did this not make the news?", "Reporters don't want to die in a plane crash?", "That is why I'm happy to be a programmer and not a lawyer. newlinechar  newlinechar [Breaking and Entering](http://dictionary.law.com/Default.aspx?selected=98), the criminal act of entering a residence or other enclosed property through the slightest amount of force (even pushing open a door), without authorization.", "problem with that is it would seem bad since Obama was running against McCain/Palin at the time...", "You're lying! I upvoted you!", "I know I'm just saying, it's not like you'd call me a rocket scientist for setting off a bottle rocket.", "Magnificent.", "You are correct, however to use your analogy, this is like calling the guy who walks in an unlocked door a master cat thief.  Are they both burglers? yes. Are they both guilty? Yes. Does one have a skillset the other does not. Yes.", "Poor reception could be a safety issue if you cant reach 911 in an emergency.  A bit of a stretch, but certainly seems more plausable than Apple's argument that jailbreaking allows terrorists to destroy key US infrastructure.   newlinechar  newlinechar You herd it here first: iPhones kill.", "Then AT&amp;T must be in the mass murder business.", "Whoah, there.  Let's not say anything we can't take back.", "&gt;I think everyone saw through that pretty instantly. newlinechar  newlinechar In the context of this article and the leaked document, of course.  But for the average person on a support call, not so much.", "... or even bring a computer of consequence into the US? ", "Ah, did not see that. But I think even then, being an in-order processor really hurts Atom in terms of performance per clock.", "19.9% newlinechar  newlinechar Huge difference.", "And may their wives receive many flowers. ", "also from the *stickler-for-accuracy-dept*: newlinechar  newlinechar the headline said 'building a computer', not 'computer and necessary peripherals'.", "An 8-bit, home-built CPU webring somehow makes sense. ;)", "Pretty much everything electronic in Japan makes the rest look like large heaping piles of shit.  newlinechar  newlinechar Go to Akihabara one day. It's like travelling two years in the future. You can even buy a robot there. ", "The internet doesn't run on windows.", "I'd write an angry blog post about it, then tweet about it, then rally the online community to boycott a place they never shop at!", "Yeah but they don't have the candy and soda gauntlet when you try to check out.  I really miss that.", "Only through mockery shall SI abbreviations ever be respected.", "I tried dating my self once, It didn't work out.", "Or it's going to create a free, open, _and durable_ (and illegal) alternative to Amazon S3. newlinechar  newlinechar If we happen to fill it up with stuff that infringes copyright, hey, the people have spoken.", "But you CAN list the fallen tree on Craigslist and people will come from all over with chainsaws to take the free wood.  True story.", "Upvoted: You said marijuana!", "And putting microsoft out of business at the same time. newlinechar  newlinechar Doubly cool!"], "lost": ["but you captured the spirit, that's the important bit.", "WAKE UP SHEEPLE!", "YES! Go! NOW! DEMAND IT!!!", "In hiding, just livin' their lives away from the craziness.", "Yeah, I think it makes things a little more tightly knit. I really like this scene."], "IAmA": ["I've been pondering the same thing - how old were you? newlinechar any psychological/philosophical issues worth pondering you didn't anticipate in advance?", "Happy sailing!", "Masturbate in mayonnaise, nobody will ever know.", "Your daughter has an awesome name.", "The third was a truck.  They call him Diesel.  Vin Diesel.", "ಠ_ಠ", "SNAP.", "Sink or swim, you gotta give it a whirl.", "Doesn't holding hands have a different meaning over there? *edit: Forgot the word 'different.'", "That's wonderful. I hope you always feel that way.", "or his little brother - Van Diesel.", "Babies *are* an interesting change - in the same way that having your house that's just stood there for twenty years suddenly burn down is an interesting change.", "Most people find it uncomfortable to admit that parenthood is not always fun. I think you're just admitting what many people are thinking. Take care. :-)", "Sure. Thanks. ", "I'm adding this to my list of reasons why I don't eat mayonnaise.", "I have upvoted you to infinity!", ":bump:", "No joke, one of my profs had seen a Mexican 'Indian' (inland from Veracruz) slowly shuffle a piano down the main street which was slung from a tumpline off his head, resting on his back.", "Just buy a shotgun and backhoe now, dude.", "No need. I've already told her mum I'm leaving them before she hits her teens.", "Lol, yeah I was being sarcastic. newlinechar  newlinechar The OP is a pretentious douchebag.", "Poor cat.  Dying in the name of science is a whole lot better than not dying at all.  At least, according to some physicists.", "AM I A TRAP?", "NO, I AM SKELETON JELLY", "I AM DRUNK OFF JELLY?", "I'd sell my soul to go to Yale (and would also choose it over Harvard)", "What kind do you want? Funny? Scary? Down right deranged? I have them all. ", "..................", "Let's start with down right deranged.", "In other words, why would you say you were only part........... newlinechar ", "Oh--haha! newlinechar  newlinechar WOOSH! :)", "Herp Derpage?", "We actually have it on sale now. I think I can find a used copy for you. Do you have an edge card?", "I've never seen the show.  I suppose I could check it out.", "One kid got rear-ended, but it was barely a tap. I have a brake on my side of the car, and crazy ninja-like reflexes with grabbing the wheel that keep us both safe generally.  newlinechar Quite a few curbs have taken one for the team though...", "Simplified: You see a lightning and know it's thundering. Son, you are no match to my wizardabilities. And yes I just wrote that as a single word.", "I had no idea I wanted this question asked, but seeing it now, I sure did.", "I have an extremely high level of 'fuck it' in my blood. I'd had him before and he was a decent driver, so I went for it. Plus, if I accused him and was wrong I would get big trouble from the parents.", "I would say we should start a website for drinkers who are introverts, to meet up hang out and drink, but somehow i don't think any of us would show up. newlinechar  newlinechar :\\", "We'll have a gay old time.", "That made me laugh.", "Excellent. On another note, back when I was in driver's ed, my teacher would roll down the window and yell: 'WE'RE TURNING LEFT!' if the kid forgot to use the blinker. I've heard so many great stories about driver's ed teachers.", "Haha that's great. I'll have to try it sometime. I generally just say very sarcastically 'yeah, turn signals are for lame-os anyway. I'm glad you're too cool for those stupid things' and they get the idea. ", "Nope, I live in California. My instructor was some 60-ish year old Hispanic guy.", "Pretty bummed really. But I'm pretty optimistic so just gotta do what I have to do with what I have.", "I didn't start driving until a month after my 18th birthday. I hated waiting but it was a very good thing to wait. Since you're much more mentally developed and mature than a 15 year old you're already SO much better off. Driving will be simple.", "Wow you sure are *sharp*.", "I definitely do that. But I'm not 70 so it's ok right?", "That's hilarious. ", "I heard this about Iran once.", "So that's what I've been forgetting to do. ", "Truth!", "It's pretty awesome.  newlinechar  newlinechar I was referring to celebrating Halloween or birthdays though. Had my first one of both of those this year. ", "I know, I was trying to make a funny. But, seriously, what are you most sad about missing for so long?", "&gt; Why people downvoting you for this? newlinechar  newlinechar No clue.", "Thanks for the responses! If you guys do control the world, please make sure McDonald's keeps the McRib in their menu full time. I'm tired of having to wait for 2 weeks every 3 years to get one. ", "Definitely birthdays. I had my first surprise party this year (I'm 26). I had never felt that kind of warm-and-fuzzy feeling as when I realized all my friends cared about me so much they would do that for me. I have no idea how I lived without that feeling.", "I haven't trick-or-treated yet. Might get my friends to go with me on that next year. People will get a story AND give me candy!", "&gt; FTFY newlinechar  newlinechar No you didn't. Because that question was the ***very first*** question asked, and answered.", "Reddit: 1, Logic: 0", "I sure don't.  I used to listen to a lot of punk, and still do every now and then.  Now I listen to a lot of public radio, and I've recently gotten into an old country kick.", "&gt; From what and to what? newlinechar  newlinechar You know I'm not going to answer that in this thread. if you want to PM me some sort of proof that you are who you're alluding to, I'll answer it. In PM.", "I'm sure raising children Muslim would be a blast.", "That is absolutely amazing...", "...that's not very agnostic of you.  Try being more uncertain.  ಠ_ಠ", "How much did that cost?", "I fail for not getting the Simpsons reference. My fandom has waned in recent years.", "Me too. And thanks for the kind words also. ", "A bit like CSI?", "*twitch*   newlinechar  newlinechar  newlinechar More like [Bones.](http://www.imdb.com/title/tt0460627/)   newlinechar  newlinechar  newlinechar *twitch*", "He commented in this thread saying he didn't. newlinechar  newlinechar And if he did, I don't wanna know.", "This would be a pretty elaborate fake..."], "entertainment": ["How about both? Never watched him before (well, once or twice in a decade- decided it was shit). But will never give *him* a second chance.", "lol, i literally just died laughing!", "Thirty-Something Mutant Ninja Turtles is more like it", "Then the puddle of motor oil grew a beard.", "Die Hard is an epic classic from the heyday of the genre as well, but when it comes down to unashamed campi-ness, ridiculous odds, and downright destructiveness I have to call it for Commando.", "I'm on a tank.", "Then the beard impregnated a bunch of nuns.", "Who gave birth to pure testosterone...", "pretty sure he was looking at himself in a off camera mirror referencing Predator", "Wait, women can see reddit?", "It was one of the best animated series ever. It doesn't matter your age. That's why I'm so pissed off that now people will assume this is what you're talking about if you talk about the real series.", "Which, to be clear, does *not* necessarily imply that people won't watch it. It just means that you don't get to act all surprised and indignant about the whole thing, and the shit given by the press will probably be significantly limited.", "Experience?", "Encyclopedia Dramatica is maintained by trolls. Do not - *do not* - use it to cite anything. Ever.", "Lucky guess?", "*pulls out a piece of paper and writes: Xzibit, Gary Busey*...", "Sure, an internet meme made him a household name", "Omniscience?", "Everyone in my household has at least 3 computers.  Also, I am the only member.", "Is that three computers for everyone, or three computers each?", "Buuuuuuuuttscratcher?", "Solja Boy (however he spells it) threatened the internet I think. ", "he got soul, but he aint a soulja", "See also: rickroll", "both", "YOU LEAVE MY GODDAMNED FISH ALONE.", "If you hotlink one of their hosted pictures they replace it with the worst things on the internet. newlinechar  newlinechar It's very disturbing.", "I see. newlinechar  newlinechar *Adds Soulja Boy with an asterisk*", "Is Xzibit a troll?", "He concatenated two smaller vocabularies.", "How sesquipidalian.", "Yo dawg, I heard you hate your meme, so we put a Streisand Effect in your meme so you can hate it longer than you would've had you not bitched about it.", "Are trolls on Xzibition?", "Buuuuuuuuttscratcher!", "Yo Dawg, bundles of sticks can't talk.", "They always made the trunks completely useless in that show, it was always like 'wow cool I got tvs in my trunk now...but I can't put anything in there ever again...woo.'", "Busey is slapping his buns and rubbing his seeds.    newlinechar An old woman is crying in the corner.    newlinechar I give you a hamburger.", "He really has fantastic teeth.", "This is the first time I'd ever heard of the Streisand Effect.  Sweet.", "Unpossible!", "You remind me of your father when he went here. He was a slacker, too. ", "&gt;I'm sad that he can't act anymore.  newlinechar  newlinechar According to Rush Limbaugh, he still is.", "I heard 60% of the time, Rush is right every time.", "Dude, he's Rush fuckin' Limbaugh. His wisdom is infallible. Between him and Pat Robertson, they know everything that has ever happened or will continue to happen in the future.", "i'll show myself out thank you very much.", "No one, NO ONE is as smart as Rush.", "There's a whole chapter: My Wife's Clit. newlinechar  newlinechar It's Chapter 4. Pages 78-104. ", "Not about impotence... :(", "Why even bother Mcfly, you haven't got a chance, newlinechar  newlinechar you're too much like your old man. No McFly ever amounted to anything in newlinechar  newlinechar the history of Hill Valley. newlinechar  newlinechar ", "Or that time in the mens shower room.", "I didn't even like the trailer that much.  I thought it was too obvious an allegory for apartheid and the movie would be heavy handed.  I was really surprised and pleased by the unexpected direction the story took.", "I guess I didn't really let that bother me much."], "Favors": ["What did [deleted] say?", "Statistics are HARD ;_;", "something like newlinechar  newlinechar &gt;because redditors are smart  newlinechar  newlinechar  newlinechar not sure why he deleted it. I was supporting his claim. ", "5 people responded that they use Netscape. 5 people lied.", "'A' for effort!"], "science": ["When it comes to magnetic containment of plasma for fusion purposes, you cannot beat a tokamak. ", "It's amazing how you distilled that idea to achieve the greatest karma to character ratio. You seem to have it down to a science.", "Very true also I recommend that everyone does a little research on the [National Ignition Facility](http://en.wikipedia.org/wiki/National_Ignition_Facility) its another cool fusion project, but with big lasers!!", "Uh not necessarily, Lawrence Livermore may be more important making ITER possibly irrelevant.", "[Aperture Science.](http://www.aperturescience.com/ 'We do what we must...')", "Meh.  It's all fine and dandy if they can ignite it properly.  But then they need a facility that could actually produce power, not just ignite fuel.", "The 1950's beg to differ.", "Science in medical fields comes to mind.", "Thankfully I always read reddit on the throne. ", "You missed the accelerometer. ", "and then testing the resulting urine and finding--horrors!--outrageous amounts of heavy metals in your urine sample.  it's b.s. like this that led to the 'mercury causes autism' panic.  remember that?", "**WHAT'S THAT? DOCTOR'S DATA?**", "It's libel all the way down...", "'Redditor for 49 minutes' newlinechar  newlinechar Yeah, safe to ignore him", "Wait, are we saying Doctor's Data for the negative SEO consequences it will have for them?", "**ARE WE EVER!**", "Well, I'll be. I almost feel bad for Doctor's Data that [the post they don't want people seeing](http://www.quackwatch.org/01QuackeryRelatedTopics/Tests/urine_toxic.html) is forever a part of the internets, now and that the links to it and the angry letter are giving them pagerank. Well, almost.", "You're not the father.", "Don't forget the current funding was exceeded due to requirements creep from adding a pancreas and an extra kidney.", "Everything went better than expected!", "If it doesn't, you could cover them in heatsinks and try that.", "He would be awesome at Scrabble.", "Well if you were under the illusion that it was achievable it would be dogmatic. If you put it in the perspective of eternal vigilance it's simply pragmatic.", "genitals", "Details were all that mattered anymore.", "The only 'big picture' was small.", "Boy and girl eaten by Grue.", "IMO, perhaps the best line from Futurama. ", "Sun comes up, green cheese melts.", "My god... I bet you've been waiting **years** just to post this article and vindicate your life's pursuit. newlinechar  newlinechar Alas, I can only upmod you once.", "LOL...no, but I remember reading about it when it first came out, and found it again after a little Googling. newlinechar  newlinechar It's funny -- I can't remember what I had for dinner yesterday, but I remembered this.", "At least there is a solution: newlinechar  newlinechar http://www.instructables.com/id/Neatly-wrap-cords-without-ties-or-tangles/ newlinechar  newlinechar I've been using this method for about 6 months now without fail.", "That's almost how climbers coil rope ([butterfly coil](http://en.wikipedia.org/wiki/Butterfly_coil)) - never fails. The difference is that the method above will ultimately leave kinks in the cable - if you fold instead of wrapping, this won't happen.", "Taste the rainbow.", "Behold, my little submission, it hath birthed some awesomeness of it's own. newlinechar  newlinechar EDIT: Damn you bscomment, you are a gag account. :p newlinechar  newlinechar I'll admit though, that user page is a hoot.", "And how musicians coil cords!", "I've always used [Over Under coiling](http://en.wikipedia.org/wiki/Over/under_cable_coiling).  It works for headphones too.", "Clearly,The Great Flying Spaghetti Monster must have wanted this synthetic life form capable of Darwinian evolution to grow in a laboratory!", "Presumably because they don't fall off as much.", "It's shit like this that makes me love reddit, and build my Claven skills on a daily basis.", "I'm a frayed knot.", "It took me a solid 30 seconds to figure out why my upvote was making your karma points get more negative.", "It sucks we have to count and vouch, when there's an advocacy group [already started.](http://people-press.org/)", "I counted a few more times, I still have 24. I didn't take in to account the fact that everyone does not have the same computer I do. I am assuming you see the post with less height/unfinished lines. newlinechar  newlinechar *P.S. I am a shithead*", "no no, he typed it 1.92 times and pasted it 100 times. newlinechar  newlinechar that's right, 'pew pev' 100 times.", "He is still wrong, all the lasers fired at once not in succession. newlinechar  newlinechar *P.S. I am a shithead*", "http://getyourasstomars.com/", "I just read why you sign all your posts, and I have to say I'm quite impressed that you've actually gone through with it.  ", "Las Spegas", "sorry to be an ass.... newlinechar  newlinechar 'This would be excellent material for a**n** introductory stats class.' newlinechar Perhaps introductory English is also needed."], "atheism": ["cool...but...atheism is not a religion, it's a nothing.  So we can't convert them to nothing.", "So let's just convert them AWAY from whatever they believe... newlinechar  newlinechar Teaching them to read should do the trick.", "Yet people are still touchy about labelling anybody a 'Christian terrorist' but throw around 'Muslim terrorist' widely.", "It's me, Margaret. ", "**CAPSLOCK ENGAGED!**", "[FUCK YEAH CAPSLOCK!](http://farm4.static.flickr.com/3281/3079877360_0e69015f82.jpg)", "I always thought that whole belief in an afterlife thing is a front.  The Pope is really running the business of selling afterlife insurance and making boy rape easier for it's uppermost members.", "I wish I could up-vote you mo- oh wait....", "He are!", "WE BE !", "I had put out the word [here](http://www.reddit.com/r/atheism/comments/by34w/ratheism_needs_a_faq_and_it_needs_one_bad_tell_me/) that I was going to be putting one up for us. It got some helpful responses, discounting LouF and a couple other troll posts.", "You'd run into serious opposition from radical Christians.  Hell, it's pretty hard to even get funding for *condom handouts* in foreign countries.", "Upvote for... turtlenecks?", "Religion *is* **fun**da**mental**.", "That is simple. It just requires someone to believe that god likes them more the the people wearing the other colors.", "Completely agree, just because people have been doing something longer does not make it any less stupid. ", "I can deal with that. I'll be too dead to care.", "Not if he remains silent as he's been taught to do.", "Don't they need to understand algebra first? ", "Yeah, I was about to post that their grammar is pitiful... maybe a result of home schooling?", "wouldn't they need to understand logic first?", "On both sides ", "would they need to think first?", "And that's terrible.", "You should tell her she must 'immune' to intellect. ", "&gt; she must 'immune' to intellect. newlinechar  newlinechar wat", "Bingo!  People have forgotten the TRICK part.  If you don't have any supplies you can always smash their mailbox!", "miltondave is immune to typing skills.", "I HAVE A SIMILAR CONDITION.", "&gt; hunter-gatherer societies still had systems of supernatural belief newlinechar  newlinechar Yes, you're spot on. Daniel Dennett likes to call these the wild, undomesticated ancestors of religions. They are the simple organism memes that evolved into the complex religions.", "You should try reading the article.", "Anarcho-primitivists are a nuisance in everybody's life, they just don't know it yet.", "I think your sarcasm sensor might not be functioning properly.", "Are those sensors expensive or used for research only or something? I keep on seeing people mention them here.. but I've never actually seen one.. and I can't find them online.", "Please don't give him any ideas...", "Thanks.  You just broke mine and now I have to go buy another one, jerkface. ", "Wait, aren't we the People Front of Judea?", "And, more important, funding.", "http://www.jesusandmo.net/2008/12/02/irony/", "I thought we were the Popular Front.", "No, he's over there.   newlinechar    newlinechar SPLITTER!!!", "And the story of Eden doesn't feature apples.", "Seriously.  Wake up, sheep1e!", "Upvoted for being somewhat of an understatement. That is a fantastic short story.", "Could we start by getting them reddit accounts?  I'd love to read their comments...", "MrPinkle here.  I was just trying to be witty by pointing out your grammar mistake while simultaneously making the same mistake myself.  Perhaps people gave my post more votes because they thought it was cute?", "Nope,  the lack of evidence for unicorns, is just evidence of unicorns' cunning ability to blend in inconspicuously. ", "I've seen Spaghetti and Meatballs and they were delicious.  newlinechar  newlinechar Ramen", "why the downmods, hes right, if you downmod you are just as closed minded as you say the religious are.", "Don't worry about that, just keep them out of Hollywood.  You guys run that town, right?  DO SOMETHING!", "By the way: newlinechar  newlinechar Christianity is Judaism for Windows. newlinechar  newlinechar Har har.", "Judaism 2.0! newlinechar  newlinechar Islam is Vista.  Very unstable.  (Sorry)", "You also made two mistake's.", "Don't thank me, THANK THE KNIFE.", "This movie inspired me to put on really bad makeup that makes me look like a burn victim.", "'Atheism spreads at the speed of thought.'", "Implied.", "'Faster than the speed of love'", "Buddhism is Ubuntu.  That is all.", "I'm thinking a little DNS trickery to make his domain redirect to ffrf.org wouldn't be over the line.", "Unicorns don't exist.", "Their balls do.", "In-*sane*! Got no *brain*!", "Exactly, and it was so repetitive. They've could have easily packed in a few more fact based arguments, instead of focusing on the 'hot chick' (which was a downer the whole season, too many titties).", "It's exactly the same thing. Great point."], "math": [":(", "I always heard it as the Fourier transform being a special case of the Laplace transform... guess it depends what sequence you go through first.", "If you don't want to factor numbers like [_jameshales](http://www.reddit.com/r/math/comments/815rr/party_trick_decimal_to_fraction/c07yqw9) described, then just find the greatest common denominator of the top and bottom. [Euclid's algorithm](http://en.wikipedia.org/wiki/Euclidean_algorithm) is a very quick way of doing so."], "wikipedia": ["Stern letters might be sent if it doesn't rain when they want it to. ", "So, they are the UN of bacteria?"], "relationship_advice": ["wisdom nugget right there.", "The idea that he would try to charm his way out of it leads me to a similar conclusion. ", "Yes it does, I totally blew my chance by not realising this.", "why don't you use her for your own needs then? there is nothing wrong in using other people for your satisfaction.", "I wondered if this wasn't the *real* thing that pissed her off.", "Thanks, I laughed."], "scifi": ["He did. newlinechar  newlinechar &gt; Fortunately he had some Doctor Who promo material on him so was able to show them who he was.", "Brilliant.", "His depth is immaterial to this conversation.", "See?!", "AKA: ImpMiniTru", "Be that as it may, I am lazy and wish to be notified of the site's creation via an orangered envelope.", "Oh it exists.  We're just getting DDoS'ed by the jedi temple on Mindoir.", "Yeah, I'd happily spend an evening scanning my collection in, I have about 2 shelves of classic SF.", "If only she could act.", "Yeah, but she was nice eye candy when she just shut up and sat there.", "Just be forgiving, the first season they were still trying to find their way. I was lucky enough to catch some of the later episodes where the hilarity flies.", "most of the time i would agree.. this one is worth it.", "WHY BILLY? WHY?!"], "canada": ["'This is the worst kind of discrimination! The kind against ME!' - Bender Bending Rodriguez", "Political voting should take place via social networking systems like reddit. One consequence would be that 1 in 3 of all elected officials would be [little cute animals](http://neatorama.cachefly.net/images/2008-12/baby-aardvark.jpg). This consequence might be good or bad, depending on whether one has a tendency to blurt 'ooo...' whenever such pictures are viewed.", "Ok, I am not normally interested in cute little animals, fuzzy things make me sneeze.  But the ug factor on that baby aardvark makes it possibly the most lovable thing I have ever seen.  And I have children.", "The ninjas know better then to mess with the Canadian military. newlinechar  newlinechar http://imgur.com/mvtAm.jpg", "Participaction!", "Holy shit! I surrender!", "That's good of you to say. It was a fun way to spend a summer.", "Can you imagine they used to have a forum/discussion board on cbc? Yeah, they took that down and I don't blame them.", "Good point; we should pull out of the US. Time to bring home the Green. And the Akroyd. And the Carrey, the Mochrie, half of Hollywood, most of the NHL and yes, maybe even gramps and gran in Florida. It's time.", "Can we give back Harper while we're at it?"], "gonewild": ["I'll forgive you, if you post some more ;)", "We can tell by the angle. Don't be ashamed:P Some of us like that here!", "I like it! Nice tush too.", "thank you!!", "Not quite ready to have my face on here."], "happy": ["cat reply... aww fuckit, [who cares...](http://i.imgur.com/5yXqr.jpg)", ":) Yes, you. You're the one I love. &lt;3", "You seem to be confused, that's Jack.", "I know who I love. ", "A fellow redditor! newlinechar  newlinechar Maybe there is hope for us all.", "Exactly what I thought.  And the audience could actually sing!", "They not only love her song so much, but they obviously love her very much as well.  And I can see why.", "It's so cool. Take any random person off the street, and they they can't sing for shit. Take 200 people, lock them in a room, and then can sing like a decent choir.", "I guess all the bum notes average-out. Now take several thousand people..", "Try the aww subreddit.", "They are all from parry gripp.  You can listen to them all at http://www.parrygripp.com  I really like frozen banana but there is no music video."], "archlinux": ["Then you add it to the AUR to save the rest of us the headache.", "of course."], "geek": ["You win. :)", "Quite a few of their [April Fool's jokes](http://www.thinkgeek.com/stuff/looflirpa/index.shtml) become real products.  I have the 8-bit tie, and it's awesome. newlinechar Edit: Actually, they actually have a form if you click 'buy now' to let them know which you'd like them to make.", "I was going to mention the 8-bit tie.  I didn't know there were others. newlinechar  newlinechar In this case, there may be a problem with licensing all these games.  And running them on an Apple product would require their approval too.", "Fascinating.", "Whenever someone asks me to pick a number, I usually pick some negative irrational improper fraction of pi, like -(17/7)i pi. newlinechar  newlinechar It's even better when that person asks if eir guess was too high or too low, and I say 'no'.", "Yeah, I thought I had seen this like 6 months ago. You can call a 6-months-old house 'new', but it doesn't work that way with news."], "fffffffuuuuuuuuuuuu": ["That'll definitely be worth the time.", "True. It pains me to hear Muse during the movies :/", "So, what is that in real words? [](/troll)", "'You just happen to be unlucky enough to need your images hosted during this small time frame.' newlinechar  newlinechar [](/fu)[](/futext)", "[](/fy1)", "You ain't cause you not.", "Nooo, [that's ignoraaaaant](http://www.somethingawful.com/flash/shmorky/babby.swf)", "[](/fu)", "Bricks, I shat them. Well done [](/perfect)", "No, it's not a picture of your prom date.", "[](/son 'Bitch.')", "EDIT: [Here you go](http://redct.info/reddit/ragefriends/requests/harpdarp.svg). ", "Problem???[](/target) newlinechar [](/troll)", "intrabestof", "Don't you mean carrots? HAHAHAHAHAHAHHAHAHAHAHAHAHAHAHAHAHAHHAHAHAHA", "[](/perfect)", "[](/gsmile 'OK dear, here ya go! *le slip deuxième*')"], "AMA": ["The Bag of Holding is my design. It is, by far, my most successful and favorite thing we sell. There are six other buyers at ThinkGeek who handle other awesome things, though."], "offbeat": ["THIS IS MY HATE PARADE BITCH I WILL STEER IT WHERE I WANT IT", "If they weren't doing that they might actually have some progress! but that's a communist term apparently... :/", "You know what I hate? Asparagus. ", "I thought it was going to be a nightmare finding something half-remembered, but apparently the example name was indeed Bob and Googling 'he looks like a bob' [delivered.](http://www.sciencedaily.com/releases/2007/05/070518164713.htm)", "Get out.", "&gt; he can peg them newlinechar  newlinechar That's a top-notch detection method.", "You have been more than informative and I regret questioning you. Thank you for the link!", "Haha, I actually debated including that little tidbit in the post, I wasn't sure if it was common knowledge or not, so I just decided to leave it out unless someone asked. ", "No, we have no idea what the hell you just said.", "I always thought it was common knowledge, but perhaps it's not.", "Yeah, unless whoever you buy from happens to have a proclivity for violence. But seeing as they're drug dealers they are most likely above using violence to resolve problems.", "Well, it's also most likely that you're not the only person who buys drugs from them.", "Oh shit, I fucked it up.", "Indeed! newlinechar  newlinechar And this is exactly how an English hobby historian told me the story some time ago.", "i was patiently waiting for the part where they somehow braid terrorism into the story. My patience paid off.", "I just looked it up.  Wow... that's like the 4th moon of Endor, the one nobody mentions.", "You the comment restater who makes the same point but with more characters?", "ts;dr", "Wouldn't it be 'Too short did not read' to combat brevity?", "Nice work McGarnicle.", "Forsooth, kind sir, but I regret to inform you that your statement was lacking in necessary verbosity; I was unable to comprehend it, and thus any meaning you attempted to transfer was unfortunately lost. newlinechar  newlinechar tl;dr: fksbirtiytyswlinv;iwutciatamyattwul", "I had no idea reading hurried the coming of spring! ", "We'll do almost anything to get spring here more quickly.  newlinechar  newlinechar (Prime example of cabin fever...spending too much time online, and not really paying enough attention to what you write.)  ", "Same here, I enjoy it on a brisk Christmas morning, but that much would make me want to skullfuck Bob Ross..", "I lived on the East Coast US in '96 and I remember getting more snow than I've ever seen before in my life that year. I was 10 years old, but playing in snow drifts taller than me was so much fun.", "It was always NYE by far, Beakman always seemed more like a lame cartoon than an education program. ", "We really ARE turning into 4chan.", "&gt;[The Parisian authorities oppose the group's actions, starting a police unit to track them through the sewers and catacombs of Paris, and attempting to apprehend and charge them.](http://en.wikipedia.org/wiki/Les_UX)", "Thanks for the translation, but wouldn't it have been easier to just write it out the first time? Unless you are trying to start a fad, and in that case: Stop it."], "Libertarian": ["You're right. It's interesting to see how the justification for taser use has shifted from being an alternative to lethal force to pain compliance for even the most minor encounters.", "American candidates can't accept campaign donations from non-US citizens.", "Wow. I did not realize that.", "Can the president really just say 'Hey Congress I don't care about any law you passed, we're going to keep funding these countries anyway'? newlinechar  newlinechar ", "as someone famously said: 'when the president does it it's not illegal' newlinechar  newlinechar welcome to America!", "Well that's something. With Obama, everything that I had faith in him to do, he did a 180 on, and everything I was terrified he would do, he did 200%. Ugh...", "Waiter! Fresh underwear, seven blankets and a bucket of moist towelettes!"], "malefashionadvice": ["Or House.", "I'm pretty sure I could pull it off. I think I'm gonna go for it.", "You'll never know if you don't try!"], "Metal": ["That's the only picture that's ever been able to pop into my mind for the past few years whenever I think of or someone mentions Metallica...", "Hmm, I can see your point. But on the other hand scientific studies on this have been linked on the BBC etc.", "I've gotten annoyed with people asking this shit every other week. So instead of giving them good answers, I give then music that isn't very accessible. Because fuck them."], "apple": ["That periodic table app looks awesome!", "For the people who only got a laptop so they can browse the web on the couch, it's a laptop killer.", "'Seems like everything on the Mac has been quiet.' newlinechar  newlinechar What?"], "todayilearned": ["AAah! I've been found out!  newlinechar  newlinechar I never thought those greasy, oniony, little burgers that I get in a cardboard briefcase would have been the first to be mass produced.", "YEEEAAAAAHHHHHH!", "really? that would be great! ", "Tell me your address and I'll post them first thing Monday Morning!", "HIKING :D", "Who's got two thumbs and has two thumbs? This guy.", "Yes, we can.", "Hooray for competition!", "I'm OPEC and what is this?", "As if you know how to end things, Mobius.", "Never ending trip.", "You can do this with pretty much any English sentence.  I mean there are a few that it won't on...", "http://en.wikipedia.org/wiki/Hubble_Space_Telescope#Flawed_mirror", "a taco fest?", "'cunt shunt' - submitted for your approval.", "The thing I love about this is that the mirror was flawed but perfectly so. So we knew exactly how it really was. This way engineers wrote a software program to compensate for the difference digitally, before they could service it in-situ."], "lgbt": ["...and did you consider the scientific implications of gay people getting another dose of gay?", "Well, not *too* much beforehand…I think I'd just mention it if he's about to flip you over or something :P but otherwise I wouldn't say, 'I'm Matthew, I don't like anal, nice to meet you!'", "Haha, very good point."], "self": ["FUCK YOU YOU'RE TOO LATE. I'VE ALREADY BANNED MYSELF AND AM MOVING TO CANCUN WITH MY ADMIN-DOLLARS. ", "I upvoted you to infinity. Fuck, I love this admin. job. I just emailed my boss and told him to go fuck himself I got a new gig!", "Negative. newlinechar  newlinechar EDIT: I changed it to Test(icles).", "So the admin powers are just an illusion :(", "Awesome April Fools joke, though.", "Indeed. Makes me feel awesome, and it's harmless at the same time.", "I kinda wished that it worked though. Imagine giving everyone admin for an entire day and then see what chaos ensues. But then at the end of the day just restore the real site.", "Mmm, they're so fermion.", "PROTIP: Ask xkcd to make you a sandwich.", "Tie penis around it to prevent it from falling out?", "I threw holy water on it.", "[Like this](http://www.youtube.com/watch?v=Au7-b77hBCE) -- the 'David Blaine' method.", "Seriously. Psycho stalker.", "I didn't see anyone upset or angry either. Its nice to see so many people getting along =)", "Yes, much more so than other news sources.", "Good luck with that 'everyone else follows' part. Show me one philosophy that everyone follows. I'll wait.", "Thank you so so much!", "I could only imagine what that had to of felt like! I think you have very feminine features, no one in their right mind could confuse you as a boy. ", "It was upsetting, but it makes me happy that other people don't think of a boy when they see me.", "She was my g/f for a year, and lived with me. But its my house that I own, I might would understand if something was in the room that shouldn't be, but I had personally cleaned the room before my family came over.", "Oh! How pedestrian! ", "Oh well.         newlinechar It sounds like it might spark a great comment debate."], "web_design": ["That, plus possibly a javascript accordion effect for the individual scientists.", "This would be a nicer profile than 95% of those epileptic seizure inducing masterpieces on myspace.", "We didn't 'kill ourselves', you heathen! It's great up here, we even have internet access. Too bad you're getting recycled, eh?", "Again?", "You should put together a shell script: newlinechar  newlinechar 1. renew your ip newlinechar  newlinechar 2. download ie 8 newlinechar  newlinechar 3. wait 5 minutes newlinechar  newlinechar 4. delete ie 8 newlinechar  newlinechar 5. repeat"], "Marijuana": ["US Legislative branch and law enforcement: 'If you guys keep getting high, we're going to take away your fake boobies!  Super serious!'", "Sounds like a win win to me.  Fake boobs are horrible.", "And he claims to be a major fan of Milton Friedman who was dead apposed to prohibition, so that's a major fail in my book. You can't be a Friedmanite and anti-legalization. It just doesn't make any sense.", "I doubt the Democrats are going to be any different though. The only way marijuana law reform is happening, is through corporations. When corporations start seeing a business in marijuana, there'll be political initiative to change the law.", "And remember to never imply ownership.", "NNOOOOOOOOOOooooooooooooo........", "If you don't get up off your asses and quit sitting out elections, you have no one to blame but yourselves.", "Always use the indefinite article 'a dildo', never 'your dildo'.", "Fuck it. Take their money, it's certainly wasted on us.", "I don't like how everyone is just forgetting/dismissing the fact that we have blatantly rigged electronic election machines.", "no shit. keep the damn ad and take the money, fuck them.", "I can get a week out of a quarter.", "still better than watching the news, we're global, and they can't report past the 500m outside their building", "Fuck, I answered yes for that one.  I was so ripped when I took it.", "212 to 64.  we win.", "It is now! Hurrah!", "Congrats! You should take a congratulatory smoke."], "bestof": ["It's okay, I censored it.", "NAKED PICS!", "Upvoted both you and the good brother.", "&gt;Have a seal over there.  newlinechar  newlinechar FTFY", "I love seals. ", "Yeah but with your username, I ain't giving seals to you!!", "&gt; Maybe have some sex. Now I just want to hug my German shepherd. newlinechar  newlinechar Make sure you don't... ah forget it. ", "Damn you.", "Do another level!", "It makes a karmanecrophile.", "- Post a clever comment in the thread with your other account. newlinechar  newlinechar - Acquire comment karma", "you sir, have started a comment thread on an unrelated topic. Upvote for you, my good sir.", "i bet you're not really pete berg. ", "It is bechus of people like _you_ that reddit is starting to crumble.  ", "No, really, he was in a movie and everything!", "wow, you are one of the few people who has pronounced it correctly without hearing it from me", "I'm pretty sure it's the other way around. Have you seen the people around here?", "I know it sounds incredible, but it's true. I wouldn't have believed it myself had I not taught both of them 5th grade math in San Diego. newlinechar  newlinechar Trust me, their dads are both asian."], "Ubuntu": ["I don't know about your version of Ubuntu, but it came stock in mine ever since I tried Ubuntu (Version 6-ish)"], "humor": ["Except you!  BANNED!", "Fine comment sir, I give you 3 upvotes", "i saw bob dylan 10 years ago and he sounded more or less like this ", "I am going to go back in and ask everyone if they are davega7. If they say no I will end the conversation and try again until I find you.", "I'd laugh if you actually found me. newlinechar  newlinechar Wonder what the odds of that would be? newlinechar  newlinechar Edit: I was just asked if I am a 'stocker'. ", "On the plus side, at least the punchline's not in the title."], "australia": ["Thirded", "That, and the photo does nothing for an image as a 'regular guy looking out for regular australians'. The golf club smacks of elitism", "pwnage gets pwned.", "Realised that after I pressed submit. Poor wording of title.", "too soon, man, too soon"], "tf2": ["Exactly--and April 1st is when we would _least expect it_.", "The commentary was the source of one long continuous cringe. 'Looks like they have a health restoration machine set up.' You mean **a dispenser**? newlinechar  newlinechar Their color commentary is monochrome.", "No.  But it should work better now, on the servers which run it.", "Wasn't asking if it became an official part of the game, but if it was getting official support.", "That's not different from what they often do. newlinechar  newlinechar [Ctrl+F 'community requests'](http://www.teamfortress.com/119/).", "Contribute to TF2 wiki, get engineer update early?", "Sorry to disappoint but I think it is probably just going to be bots that fill in for human players to keep the teams even.", "RED pills here.", "Isn't that already done? You can play with bots on both online and offline koth maps.", "I thought the Brain Slug was the best Pyro hat.", "and my a... oh wait. damn.", "Sure, he might be behind you. Let me check.", "I don't care, I'm not using it much... English is not my native language and my new company is not international. I hope I'm not being downmodded for this single tiny word (even if it's stupid for you english natives) :|", "Hey, if you use an old/broken version of SourceMod, you can tauntkill them :&gt;", "*removes pipe from mouth, querying* newlinechar  newlinechar ...Balls, you say?"], "sex": ["I'm gonna try a weekend.", "We've all been there. ", "Spooky sex, Doubly spooky if there is a pregnancy scare!", "I Like this one alot. Do you have experience with said method? Is it as rawrsome as I think it would be?", "A troll with a conscience, now I've seen everything. ", "good point.  makes my wife squirm with delight.  better?", "I'm hoping my boyfriend isn't secretly wishing that I'd ask him to do this, now. ", "Should have been more clear. What I meant was when the girl strokes her hair behind her ear to keep it out of her face.", "I will gladly put down my controller for you. ", "Took me until walkingoceans' comment.", "better.", "o dat aint rite", "...You must've had a shitty geek boyfriend, I take it. As much as I like games, I'll go through a bit of work to please a gal and save the gaming for later. It's worth the effort, or so I'd like to think."], "comics": ["Dammit, I went south and was eaten by a grue. newlinechar  newlinechar :(", "if you light your lamp before going south you can bypass him. ", "I got rather upset until I noticed the duplicity.", "Damn. You're a nerd.", "&gt;The locations actually correspond to the lyrics of the song 'Go West' by *The Village People*: newlinechar ", "Verbal Kint was his sled.", "what? damnit i hope this doesn't mean anything.  I am looking away as I type this trying to obscure what you said with other thoughts.  DAMNIT! newlinechar I wasn't supposed to smoke tonight man, now I have to try and confuse my memory!", "Why you do this", "It's his sled.", "Hmm. Looks like there's a \\*puts on sunglasses\\* hole in my theory.", "YEEEEEEEAAAAAHHHH", "Yeah, there's a difference between leaving you wondering and the story not making sense.", "I just saved you two long boobless hours. ", "Ah okay. Don't have an ounce of artist in me, so I didn't know.", "Want some?", "I-what?", "YES!", "I know, I miss him too.", "There was just a big exam in April.", "Should have learned the lesson that windows doesn't erase the data, just the structure of the folders, and most data is recoverable.", "C:\\Documents and Settings\\Username\\My Documents\\Porn", "Good thing he was boning up for it.", "There was an extensive oral portion to it", "The right order is: newlinechar  newlinechar &gt;Porn newlinechar  newlinechar &gt;trojan newlinechar  newlinechar &gt;12 year old girl newlinechar  newlinechar Just saying.", "Say goodbye to your day, you'll want to read each and every one.", "'Trade Paperback' seems more apropos, even if it's not even close to descriptive. "], "xkcd": ["&gt;guest@xkcd:/$ ed newlinechar  newlinechar &gt;Unrecognized command. Type 'help' for assistance. newlinechar  newlinechar Blasphemy!"], "energy": ["In 33 years you may want to replace so much that slicing the sub open isn't that big a deal."], "Python": ["Here, have an infinite number of upvotes.", "There was still time to back out if I failed at the PumpkinPy."], "Frugal": ["This is such an awesome idea. So awesome I had to leave an orangered instead of just an upvote. Thank you.", "I'd say somewhere in-between a youtube video and a good v0 mp3.", "Unfortunately, not everyone has a choice. Although those that don't have a choice should probably stop slacking off at work anyways.", "...That is if you paid it off completely.", "It more talked about the suits as a way to spot this. The moral was: Don't spend money where suits spend money.", "Well, you might want to just let it drop ... in-laws and all.  About the least frugal thing I can think of is probably divorce.  ;) newlinechar ", "Some can, some can't; it depends largely on the valve seating material.  Likely at some point her car got a top-end job done where as a matter of course they would have replaced the original valve seats with modern-style, harder seats."], "NexusOne": ["No idea why you're being downvoted... I completely agree with you. newlinechar  newlinechar I did, however, add a skin to it."], "philosophy": ["I can't tell if I'm pleased to know that not everyone on 4chan is 13 years old and ignorant, or if I'm worried to know that there is a potential PhD out there that browses 4chan.", "I'm doing a phd in political discussion online and, uh, yeah. There's a few of us."], "obama": ["In fairness, you're suggesting that we let the terrorists win.", "Everyone's reddit is a little different."], "promos": ["Nice try, Papa John.", "Shit!", "Even better: newlinechar  newlinechar &gt;Oh, there was a really great discussion about that a few months ago, it's over here: [http://www.reddit.com/r/reddit.com/comments/ckiug/carl_herold_is_helping_thousand_learning/](http://digg.com)", "Is there an optional prison-rape resistant soap-on-a-rope feature?", "Depends on what you went to prison for..."], "netsec": ["modded up to infinity."], "Music": ["Nine Inch Nails is another great example. Some of his songs can not even be listened to with the context of the album.", "[The Mars Volta.](http://imgur.com/hL9mD.jpg)", "Aww, don't clump Radiohead with Muse!", "And for 70 years after their death, they were clearly DECOMPOSING.", "A drum kit just fell off a cliff somewhere.", "Hey, must be a devil between us.", "Or whores in my head", "Whores at the door.", "I thought he was cheesing.", "...cause it's FON-TO-DUE", "Personally, I check out riaaradar.com and only purchase albums that are certified produced by RIAA members.", "i only purchase pitchfork approved RIAA produced albums", "2 and 3 have the same name in the flash player, but are different songs.", "I only torrent pitchfork approved RIAA produced albums.", "thanks for the catch. fixed", "WOOOOOW. Ok thats the next one. ", "Selling invites omfg!!!!!1!", "I thought they were both soooooo cute so I didn't mind."], "news": ["apart from sensual mud wrestling", "Dammit, dammit.  **Dammit**. newlinechar  newlinechar I also would have accepted 'damn it.'", "That's the problem, we don't know. ", "Is Egyptian Arabic very different than Iraqi Arabic?", "I honestly have no clue.  Just trying to raise a smile.  But apparently someone doesn't like me, or misunderstood my intent.  Just like IRL!"], "feminisms": ["I'm guessing the kid hasn't really connected the 'singalaydees' in the song with the concept of single ladies. They're not so good with lexicography at that age. That's why they say stupid shit all the time. :) "], "Economics": ["Not to mention that [the US gold reserves haven't been independently audited since the 50s](http://www.reddit.com/r/reddit.com/comments/bl3d6/is_there_any_gold_inside_fort_knox/).", "Not for long. I'm thinking that three weeks should give them time to 'calm down'. newlinechar  newlinechar Now, if this was 50~100 years ago, when the people actually grew food ... well, then it would have taken a while...", "I would be surprised if they were supernatural occurrences.", "I think Locke's [Second Treatise](http://en.wikipedia.org/wiki/Second_Treatise_of_Government#Second_Treatise) is a great introduction, as it's an undisputed classic and touched off the whole philosophical exploration of natural rights.", "Sting never mentioned Ayn Rand in a song. Nabokov 1, Ayn Rand 0.", "Maybe they didn't drink enough asshole tea?", "But [Kid Rock](http://www.lyricstime.com/kid-rock-where-u-at-rock-lyrics.html) did by name. Rush was a big fan and incorporates a lot of her into their songs.", "You mean we've borrowed a lot of money from the Chinese to buy rugs from Chinese manufacturers...", "No sirree... we borrowed the money from them solvent American banks."], "dwarffortress": ["My pleasure! The official site is being raped by desperate dwarves! :)", "You won the race by the means of a false start, my friend.", "I'm guessing this will lead to me having lots of FUN :)"], "Fitness": ["He's a bit fat...probably pretty strong too.", "MMMMIIIIIIIIIIIIIIIIILLLLLLLLLLLLLLLLLLLKKKKKKKKKKKKKKKKKK!!!!!1", "Me too. And my axe. ", "Thats gotta hurt"], "trackers": ["You could always do the interview :) newlinechar  newlinechar The info you learn preparing for it is pretty useful too."], "linux": ["&gt;guest@xkcd:/$ sudo apt-get dist-upgrade newlinechar  newlinechar  newlinechar  newlinechar &gt;You are already running Windows. newlinechar  newlinechar  newlinechar  newlinechar Very well played.", "It is. I was being a bit sarcastic there. newlinechar In fact you're applet was what just notified me your response.", "Mostly give us a pretty solid vision of what the world would look like *without* FOSS.", "No, it means get rid of kdelibs altogether and code KDE purely as a Qt project.", "[YouTube](http://www.youtube.com/watch?v=TIn3GDRqJWw). You ought to give it to the guys writing this stuff, creating a YT account with a bunch of videos, a photobucket redirect and a Windowsy explorerly site is a good deal more creative than most of their *competitors* are willing to go.", "What about my running KDE?", "You need to catch it.", "DAMN KIDS, GET OFF MY LAWN", "And with that, the Internet fell silent.", "&gt;it's just me, or the quality of reddit submissions are almost at the digg level? newlinechar  newlinechar Not until Apple press releases are top stories.", "I've got them in /home/derram/.wine/drive_c/windows/system32.  newlinechar  newlinechar Though I'm guessing as soon as you end whatever .exe program you're running (and therefore wine), whatever the virus does will stop.", "Yeah, CPU-freq and laptop mode stuff.", "have you tried powertop? newlinechar  newlinechar also, is the 7 hours actual time vs time estimates? I think wxp estimates time more generously... newlinechar  newlinechar ", "wow! thanks", "Hm. Looking at the Adobe AIR page, it needs specific 32-bit libraries, so Arch would still need to include those for AIR apps to work. newlinechar  newlinechar I'll have to poke around a bit, but looks like I'll be installing arch at the end of the semester.", "Wow, Windows 64bit has barely taken off yet, and arch is already dropping 32bit.  I guess [ESR was right](http://www.catb.org/~esr/writings/world-domination/world-domination-201.html).  Maybe the shift to 64bit will be the golden era of Linux.", "Sonofabitch."], "movies": ["Long live Kubrick?", "But James Earl Jones is still alive.", "Argh. Can't unsee.", "Where?", "that was just his kick.", "Brick and The Lookout. Not box-office successes, but they got him enough critical attention that he stopped being the kid from 3rd Rock.", "Don't forget Mysterious Skin.", "There.", "If it were any worse, they'd have to totem away in an ambulance.", "It's not your fault.", "This is how I describe my conversations with coworkers, which is why I love this movie. newlinechar  newlinechar Me:  Hey so I was learning about Amish culture last night newlinechar  newlinechar Them interupting:  Your shits all retarded and you talk like a fag.  "], "Eve": ["i'll pass on the message"], "EmmaWatson": ["one can't link directly to a 4chan post, because they'll disappear quickly."], "business": ["TRY GETTING A RESERVATION AT DORSIA NOW YOU FUCKING STUPID BASTARD! ", "Tyrannosaurus Rex: Too big to fail newlinechar  newlinechar  newlinechar  newlinechar Oh wait..", "Not to mention that $12/hour sounds a lot worse than $24,000 a year.  Still, a 66% pay cut does suck."], "redditisland": ["Fucking newfags"], "gadgets": ["My gmail inbox says [you're full of shit](http://i.imgur.com/gQs5Q.jpg) newlinechar  newlinechar Extra information: I haven't purchased an Apple retail product since 2005.", "The list you are on is one you opt in to, which you can opt out of at any time. newlinechar Your just under six thousand unread emails demonstrates p clearly that you probably don't bother looking for unsubscribe links on emails.", "Definitely an accident waiting to happen.", "or is it AstroTurf? ", "If you watch the video he burns his thumb with it."], "unitedkingdom": ["I cant decide if thats a good thing or not."], "starcraft": ["ohhhhhhhh, I do think you're right that I've only seen it with Zerg.", "Haha, saying defiantly rather than definitely makes that sentence really funny. But I completely expect to be messing up a lot and not doing things crisp or properly. ", "That's just uhh, that's not possible. ", "I suppose i'm too used to the civil reddit community", "Well, I'm just slow on my build. I did expect to get matches with similar people that are just plain noobs like me. Not people that can do a perfect rush with a hidden double gateway near my base.", "I am liking Husky more and more. He may not be as knowledgeable as Day9 but his commentary is sure colorful.", "shut up faggot", "That's what i'm talking about, so civil, you fucking cock sucker. newlinechar It's done with love ;-)", "It's especially effective in late game!", "######  Idra has a gun.", "Most normal thing in the world. most normal thing in the world.", "Which he does.", "Anyway, you are correct in that IdrA is a monster but HuK can't even keep with macro like some GSL RO64 Koreans. I think he needs another level in macro part so just needs more practice. I just hope he does well in GSL3. ", "That's true, I guess. Or, he could've started up a stargate after he saw that. I think he panicked a bit. Once you have Level 1 air you sorta HAVE to go air, imo. The sad part is that protoss air isn't that powerful by itself. ", "Wow, I didn't think single race players used grid."], "bicycling": ["Because, man.  It's all about the simplicity.  Man.", "Shiiit, why didn't you say so in the first place, player?"], "circlejerk": ["Oh, hey, it's the plot from *Primer*.", "no it isnt", "I see both sides...I upvoted both posts. What do I win?", "AH AH AH AH AH AH!"], "baseball": ["You can't hate Rivera, no matter how much you hate the Yankees.", "Like all good Americans, I hate the Yankees, but you always have to appreciate incredible skill like that."], "biology": ["[BBC article with additional images](http://news.bbc.co.uk/1/hi/science_and_environment/10461066.stm)"], "MW2": ["YOU SHOULD USE PAPYRUS ON EVERY VIDEO!", "Alternating, dur.", "Scrolling, flashing, and alternating between Papyrus and Comic Sans."], "Guitar": ["Thank you. The body was built by a very talented and affordable builder who goes by the name [Rhomco](http://www.rhomcoguitars.com/)", "I agree completely on the distortion. It was hard to hear the guitar over the constant 'buzzzzzzzzzzzzzzzzzzzzzzzzzzzzz'"], "books": ["As a person who suffers from thin-skin disorder, this highly offends me!", "I suggest Skin Thickening for Dummies.", "'Dumb' is a politically incorrect term for deaf people, (deaf and dumb) referring to their less than perfect speaking abilities. -- so I assume this was a joke", "surprised this is getting less love than it should."], "skeptic": ["You might do well to sacrifice a goat to. You never know! :p"], "RPI": ["upvote for things that are nice to think about but will never happen"], "conspiracy": ["Absolutely, this seems very one sided. ", "Yea, that's a pretty well proven fact- [Geoengineering and Chemtrail related patents](http://www.lightwatcher.com/chemtrails/patents.html).", "I agree with this man! That was totally not an apple!"], "ireland": ["That's just how some people roll, unfortunately. "], "Christianity": ["Well, he had a colorful past -- but isn't that the point? He found a new life in his faith, and it was quite powerful. newlinechar  newlinechar By the way, the comic that tells about his past is coming out soon.", "There was an episode that made me wonder if the shepherd role was only a cover for something else.  I guess the comics will answer that."], "tipofmytongue": ["Yes! :)"], "QueerTransmen": ["Knowing that you probably know next to nothing puts you at the front of the pack though. newlinechar  newlinechar Bonus points for effort. :)"], "kde": ["Perhaps so. But the reason Thumbs.db gets a lot of hate is because it creates a thumbnail file in every directory with pictures. If it stored it centrally somewhere where it didn't clutter up your filesystem, that would be nicer. "], "sweden": ["uppbåt"], "startrek": [":( I was hoping this was not the case... it was an epic episode... damn my brain loves DS9"], "WebGames": ["Wow I just gave up after about 40 or 50.  That's determination. ", "any time. newlinechar  newlinechar ", "No, seriously dude. Can you post a link so we can check it out?", "[Now with less of me being a dumbass!](http://www.reddit.com/r/WebGames/comments/9g1bp/castle_quest/)"], "somethingimade": ["Definitely upvote. Harmonicas beat iPhones any day of the week."], "guns": ["Do Your Homework!", "How much chuck could an upchuck chuck if an upchuck could chuck chuck?"], "boston": ["Additionally, for those who hate fun, it will be a disaster of epic proportions."], "food": ["I thought of preparing the agar plates... that shit smelled awful.", "It's annoying that I would never cook half of what any of them make. 'HI I'M PAULA DEEN, TODAY, WE'RE GONNA MAKE BUTTER DIPPED BUTTER AND A LARD SANDWICH YA'LL.'", "Lol.  Lol indeed sir.", "You forgot to deep fry it.", "yes niceguy, this is what i do. it's handy. freezing garlic? bullshit"], "ColbertRally": ["To be fair, you showed me the fire cannon too...", "cannot confirm/deny.", "eat more chikin?", "nah, we are leaving one man behind.", "Nice. Is he aware of this? Are you drawing straws? Rock Paper Scissors?", "Yeah, the one person that doesn't have stuff to do."], "Cooking": ["[Huh?](http://en.wikipedia.org/wiki/Zeratul) ... Yeah, exactly like that &amp;#3232;_&amp;#3232; newlinechar ", "The best way you can help me, is to leave me alone. I am in my happy place while cooking, let me be happy. If you insist upon helping me do something, go vacuum.", "When we remodel the kitchen, we're going to put in a small sitting area where I plan to liquor up anyone who tries to 'help' me make the meal. Everybody wins!"], "Minecraft": ["Terrible.", "You can bounce his fire back at him with your sword. LoZ:OoT much?", "I would love to.. Unfortunately, my computer barely runs Minecraft at lowest settings, and even then it lags like a bitch. So I have to resort to buckets of lava to kill them, else I'll get a fireball in the face. ", "Er, it is a photo...cube and all.", "woosh ...", "Auw, I am sorry to disappoint. But, you've got to know by now that the cake, it is a lie.  ", "I sympathize with both of you, since the last update that error is incredibly deadly. newlinechar ", "I thought he was referring to the idea of still lava in the nether replenishing the way water does in large bodies on the surface - I haven't been to the nether yet, so I wouldn't know.", "was that the sound of the joke passing over my head?", "Yes. To be fair I didn't think the joke was that funny, but that's just me.", "UV reactivity would be *the coolest thing ever*.", "Very resourceful ", "TIL a shoebox with blood in it might work as a camera", "It was kinda funny, because my day job is as a CG artist :D (sadly not the kind that gets you money to buy a new car though, heehee)", "Yes but the point of using the Nether is for fast travel, so you can Enter and exit the Nether through the same spot, but not actually travel through it. It's a bit of a hassle if the only thing you can use it for is for making torches.", "it should be possible...I'll have to try a few bits of black magic. ", "You should see how I earned my LAST dollar!", "I'll pass, Unless it involved DSL service and your a hot chick.", "No no no...the blood is for *developing* the film.  Not trying to be a camera nazi, just don't want to see you walking around with blood dripping out of your camera, my, that would be embarrassing. "], "seduction": ["AA stands for Approach Anxiety. There's a dictionary of these abbreviations on the sidebar.", "So there is... I should not make jokes.  Apologies, that was unproductive."], "nfl": ["Ah.  Well, you can see how everyone thought you were implying more.", "Not since 96", "OH SNAP", "I don't, but I felt these guys were on hotter seats. "], "history": ["Yes I was good sir.  Thank you."], "DIY": ["I second the amazingness of these.  We use them in research all the time."], "leagueoflegends": ["I like the overlay, and it sounds a lot cleaner.  Plus the interface is a little more easy to navigate.  I'm not a huge evangelist for either one, just can't see anywhere that vent is better."], "pokemon": ["You grew six inches between those two photographs?", "Wait, which one do you think I look taller in? I'm confused. ", "http://imgur.com/tp8Mk.png newlinechar  newlinechar Perhaps I simply don't fully understand the way that particular piece of attire works."], "Art": ["lol... he'd have to get a crap load of screen burned, a lot of artwork printed, the cost would be more than trying to get a printer to do it. newlinechar  newlinechar "], "meetup": ["Vancouver"], "space": ["Sometimes their telescopes are too big."], "ronpaul": ["Too right. That killed it for me."], "sports": ["This is why Japanese people are obsessed with the concept of robots with cannons in place of arms."], "logo": ["Yes. I, Stephen Colbert, have annihilated that beast.", "it's true. i did."], "karmaparty": ["I was SMARTer and brought the pure Stuff", "I don't see the paradox then, stoned... ;p", "its ALL in the paradoX", "a pair of dots? acid? where?", "Ah. newlinechar  newlinechar Well, I'm glad they haven't gone through with changing the voice actors; Professor Farnsworth isn't Professor Farnsworth without that legendary voice to proclaim 'Good news, everyone!'", "Currently burning a Frozen Hole into my Freezer "], "apathy": ["sad downvoted attempt to end pun thread", "Pun using word from downvoted attempt that gets upvoted unreasonably."]}